{"speakers": [], "chunks": [{"timestamp": [0.0, 2.88], "text": " All right."}, {"timestamp": [4.36, 9.3], "text": " So last week, there was a chatting about V-Sekai,"}, {"timestamp": [9.42, 13.42], "text": " and then I think Gary said something in the side chat"}, {"timestamp": [13.42, 16.72], "text": " that it might be a good project for the Linux Foundation."}, {"timestamp": [17.76, 19.96], "text": " Do you want to catch me on what was said there?"}, {"timestamp": [29.54, 31.36], "text": " basically we were talking about which projects had implemented"}, {"timestamp": [31.36, 32.32], "text": " OMI protocols"}, {"timestamp": [32.32, 34.18], "text": " and we mentioned"}, {"timestamp": [34.18, 37.14], "text": " a bunch of projects including"}, {"timestamp": [37.14, 39.16], "text": " like we talked about Mozilla"}, {"timestamp": [39.16, 40.94], "text": " Hubs, we talked about Giddo Engine"}, {"timestamp": [40.94, 43.34], "text": " and Giddo Engine based projects like Vsec.ai"}, {"timestamp": [43.34, 44.72], "text": " and the Mirror and"}, {"timestamp": [44.72, 46.24], "text": " specifically some attention"}, {"timestamp": [46.24, 47.72], "text": " was given to V-Sec Eye"}, {"timestamp": [47.72, 49.84], "text": " because it is"}, {"timestamp": [49.84, 52.06], "text": " aiming to be like a VRChat"}, {"timestamp": [52.06, 52.86], "text": " clone in Giddo."}, {"timestamp": [59.44, 59.96], "text": " I'll"}, {"timestamp": [59.96, 62.3], "text": " happily elaborate, but not all of it"}, {"timestamp": [62.3, 63.82], "text": " is coming back to me because it was"}, {"timestamp": [63.82, 65.3], "text": " a long conversation."}, {"timestamp": [67.78, 69.9], "text": " It sounded like it was a very fruitful one."}, {"timestamp": [70.04, 79.64], "text": " I need to go back and see if my recording did well or if someone else can check if it's just a whole file because I'm getting only the first 15 minutes."}, {"timestamp": [79.64, 91.52], "text": " But it sounded like there was a lot of good stuff being discussed from that. Part of it was sort of thinking about how we could maybe..."}], "text": " All right. So last week, there was a chatting about V-Sekai, and then I think Gary said something in the side chat that it might be a good project for the Linux Foundation. Do you want to catch me on what was said there? basically we were talking about which projects had implemented OMI protocols and we mentioned a bunch of projects including like we talked about Mozilla Hubs, we talked about Giddo Engine and Giddo Engine based projects like Vsec.ai and the Mirror and specifically some attention was given to V-Sec Eye because it is aiming to be like a VRChat clone in Giddo. I'll happily elaborate, but not all of it is coming back to me because it was a long conversation. It sounded like it was a very fruitful one. I need to go back and see if my recording did well or if someone else can check if it's just a whole file because I'm getting only the first 15 minutes. But it sounded like there was a lot of good stuff being discussed from that. Part of it was sort of thinking about how we could maybe..."}