{"speakers": [], "chunks": [{"timestamp": [0.0, 3.4], "text": " Yeah, so hello everyone."}, {"timestamp": [3.68, 7.56], "text": " So the main topic of conversation recently"}, {"timestamp": [7.56, 9.98], "text": " in the Open Metaverse Interoperability Group"}, {"timestamp": [9.98, 13.6], "text": " was about a sort of, inspired by Burning Man,"}, {"timestamp": [13.6, 17.56], "text": " a sort of Metaverse festival, MetaBurn something."}, {"timestamp": [18.24, 21.88], "text": " But then conversations that we had throughout the week"}, {"timestamp": [21.88, 23.04], "text": " in the lounge and so on,"}, {"timestamp": [23.52, 32.04], "text": " there was concern about having a specific event that causes a lot of stress for people to deliver on a deadline."}, {"timestamp": [32.26, 36.86], "text": " And I'm not actually sure we are, you know, we don't, well, we don't have the resources"}, {"timestamp": [36.86, 37.72], "text": " to do that."}, {"timestamp": [38.46, 43.24], "text": " So an alternative was suggested more of a documenting the journey."}, {"timestamp": [43.84, 46.54], "text": " So it's sort of like a behind the scenes documentary"}, {"timestamp": [46.54, 54.42], "text": " um where we invite people to share the journey of building a some sort of a festival um that"}, {"timestamp": [54.42, 60.68], "text": " happens across virtual worlds rather than a final event where we that we ask people to witness"}, {"timestamp": [60.68, 66.26], "text": " because that's less welcoming than asking people to build with us um so that's"}, {"timestamp": [66.26, 72.66], "text": " been the main main thing and then jimmy's organized an event for friday um so i suppose"}, {"timestamp": [72.66, 83.1], "text": " that we can cover with working group updates um yeah anyway so welcome everyone"}], "text": " Yeah, so hello everyone. So the main topic of conversation recently in the Open Metaverse Interoperability Group was about a sort of, inspired by Burning Man, a sort of Metaverse festival, MetaBurn something. But then conversations that we had throughout the week in the lounge and so on, there was concern about having a specific event that causes a lot of stress for people to deliver on a deadline. And I'm not actually sure we are, you know, we don't, well, we don't have the resources to do that. So an alternative was suggested more of a documenting the journey. So it's sort of like a behind the scenes documentary um where we invite people to share the journey of building a some sort of a festival um that happens across virtual worlds rather than a final event where we that we ask people to witness because that's less welcoming than asking people to build with us um so that's been the main main thing and then jimmy's organized an event for friday um so i suppose that we can cover with working group updates um yeah anyway so welcome everyone"}