{"speakers": [], "chunks": [{"timestamp": [0.0, 180.78], "text": " Thank you for that. you you you And it says they will not be able to join today. you you There we go."}, {"timestamp": [182.78, 186.0], "text": " All right, well, I guess we should get started with the meeting then."}, {"timestamp": [186.24, 191.12], "text": " I don't know if more people will show up, but regardless, they'll just miss the first part if they do."}, {"timestamp": [192.58, 197.36], "text": " Welcome, everyone, to the JLTF meeting for today, September 5th."}, {"timestamp": [197.6, 199.82], "text": " I've got a few things on the agenda here."}, {"timestamp": [201.2, 209.7], "text": " Mostly, we had discussion on vehicles, but I also did some work on joints to make them more like chronos slash Microsoft physics."}, {"timestamp": [210.54, 217.16], "text": " And I've also got that existing PR for physics materials right here."}, {"timestamp": [219.3, 223.9], "text": " And so we can jump into whatever these we want to discuss."}, {"timestamp": [223.9, 224.68], "text": " So we can jump into whatever these we want to discuss."}, {"timestamp": [230.18, 230.72], "text": " And I can screen share, but if anybody would like to volunteer their own screen share, that would be wonderful."}, {"timestamp": [239.16, 289.1], "text": " Because I don't want to go through the extension because I already made it so I know everything. I would like to go through it at somebody else's pace, you know? So anyway, we've got the vehicle extensions and the vehicle extensions uh there's the body the"}, {"timestamp": [289.1, 295.08], "text": " wheel and the thruster and also uh after last week's meeting i added another one to the list"}, {"timestamp": [295.08, 318.96], "text": " uh the hover thruster so there's a hovercraft as well um but yeah this can be used for any type of vehicles. There's cars and spaceships and rocket ships. And yeah. And more can be added. You can add like extensions for like boat sails or like rudders or airplane wings or..."}], "text": " Thank you for that. you you you And it says they will not be able to join today. you you There we go. All right, well, I guess we should get started with the meeting then. I don't know if more people will show up, but regardless, they'll just miss the first part if they do. Welcome, everyone, to the JLTF meeting for today, September 5th. I've got a few things on the agenda here. Mostly, we had discussion on vehicles, but I also did some work on joints to make them more like chronos slash Microsoft physics. And I've also got that existing PR for physics materials right here. And so we can jump into whatever these we want to discuss. So we can jump into whatever these we want to discuss. And I can screen share, but if anybody would like to volunteer their own screen share, that would be wonderful. Because I don't want to go through the extension because I already made it so I know everything. I would like to go through it at somebody else's pace, you know? So anyway, we've got the vehicle extensions and the vehicle extensions uh there's the body the wheel and the thruster and also uh after last week's meeting i added another one to the list uh the hover thruster so there's a hovercraft as well um but yeah this can be used for any type of vehicles. There's cars and spaceships and rocket ships. And yeah. And more can be added. You can add like extensions for like boat sails or like rudders or airplane wings or..."}