{"speakers": [], "chunks": [{"timestamp": [0.0, 11.34], "text": " Alright, I still need to work up some agenda points, but do you guys want to introduce"}, {"timestamp": [11.34, 18.64], "text": " yourselves, anyone new or coming back, and tell us about your interest in the metaverse?"}, {"timestamp": [18.64, 25.94], "text": " Michael, seeing that I put you on the spot, you can go again. Sure."}, {"timestamp": [31.88, 32.88], "text": " Well, metaverse I am tangentially interested in."}, {"timestamp": [42.82, 46.72], "text": " Yeah, so I think I'm more so interested in working with Aaron a little bit on some of the GLTF standards that have been put in place um i'm very very interested in the idea of"}, {"timestamp": [46.72, 54.38], "text": " getting the gltf standard to embody uh game objects right not just renderables"}, {"timestamp": [54.38, 61.5], "text": " like meshes and transforms but you know creating open standards for basically transporting"}, {"timestamp": [61.5, 66.92], "text": " uh game objects around i think that's going to be crucial to be honest to an open metaverse"}, {"timestamp": [68.22, 71.36], "text": " to just you know allowing that portability of"}, {"timestamp": [72.56, 75.88], "text": " Basically game entities. So but yeah my background"}, {"timestamp": [76.32, 81.86], "text": " I'm I teach engineering by trade and then I dabble in everything 3d"}, {"timestamp": [82.32, 84.5], "text": " gamedev make my own games and"}, {"timestamp": [88.42, 94.7], "text": " All that good stuff. Yeah yeah that's me that's awesome great to have you here and yeah just to echo i think everyone here"}, {"timestamp": [94.7, 102.3], "text": " has a sort of a wide interest in the metaverse but in many ways tangential to things that we're doing"}, {"timestamp": [102.3, 107.98], "text": " um i'm sort of seeing the broader picture, big picture to the metaverse."}, {"timestamp": [108.26, 109.48], "text": " So that's great to have you here."}, {"timestamp": [109.54, 113.0], "text": " And I totally agree about the interoperability of game elements."}, {"timestamp": [114.9, 119.6], "text": " Myself, I'm an academic and sort of from a non-IT background altogether."}, {"timestamp": [119.96, 124.72], "text": " And just seeing the potential of games and game engines into other aspects,"}, {"timestamp": [124.92, 127.92], "text": " I think we really can work and learn more from each other,"}, {"timestamp": [128.04, 131.32], "text": " and so really happy to be in this group and do exactly that."}, {"timestamp": [132.48, 134.5], "text": " So a big shout out to my community members."}, {"timestamp": [135.92, 136.7], "text": " Anyone else?"}, {"timestamp": [137.02, 139.96], "text": " Ice, do you want to introduce yourself again?"}, {"timestamp": [139.96, 141.86], "text": " I don't know if you have already."}, {"timestamp": [142.18, 142.76], "text": " You must have."}, {"timestamp": [142.9, 143.76], "text": " Sorry, my brain."}, {"timestamp": [144.6, 146.52], "text": " Anyone else want to have a say?"}, {"timestamp": [147.48, 149.26], "text": " Tell us about how your week's been."}, {"timestamp": [150.96, 172.94], "text": " Anyone want to game up anything this week? Aaron, what's updates on DLTF"}, {"timestamp": [172.94, 175.22], "text": " working group? What have you guys been up to"}, {"timestamp": [175.22, 175.72], "text": " in the last week?"}, {"timestamp": [177.94, 179.26], "text": " Well, we discussed"}, {"timestamp": [179.26, 180.82], "text": " a bunch of"}, {"timestamp": [180.82, 182.7], "text": " things in the last meeting."}, {"timestamp": [183.08, 183.56], "text": " Mostly"}, {"timestamp": [183.56, 186.18], "text": " getting everyone"}, {"timestamp": [186.18, 187.06], "text": " caught up on"}, {"timestamp": [187.06, 190.0], "text": " what the extensions are, like with"}, {"timestamp": [190.0, 192.32], "text": " Michael Jarrett and YS."}, {"timestamp": [193.38, 193.76], "text": " And"}, {"timestamp": [193.76, 198.32], "text": " we discussed and reviewed"}, {"timestamp": [198.32, 200.32], "text": " some of the PRs"}, {"timestamp": [200.32, 202.02], "text": " that are already there,"}, {"timestamp": [202.12, 203.84], "text": " including the shape-typed"}, {"timestamp": [203.84, 210.74], "text": " audio one, which we merged, and then the physics ones are still being looked at."}, {"timestamp": [220.16, 221.36], "text": " Well, that sounds great."}, {"timestamp": [221.5, 223.12], "text": " Sounds like there's good steady progress there."}, {"timestamp": [223.62, 226.0], "text": " Any other comments on GLTF working group?"}, {"timestamp": [230.0, 232.0], "text": " No."}, {"timestamp": [249.36, 254.78], "text": " Right, then I'm trying to get Jimmy's progress on the media team that I missed again yesterday. Jimmy, do you want to chat about your work in motion thing?"}, {"timestamp": [255.3, 258.2], "text": " And if you are only on text, I can run with it."}, {"timestamp": [258.42, 258.84], "text": " Yeah, cool."}, {"timestamp": [259.04, 259.54], "text": " Yeah, sure."}, {"timestamp": [276.48, 291.4], "text": " I was just thinking at the last media session that maybe we could post more of these counterparty Twitter space events, expose OMI out to a wider audience than we get on a on a discord session for instance or in one of the"}, {"timestamp": [291.4, 301.58], "text": " metaverse world hopping events or things that we've done you know"}], "text": " Alright, I still need to work up some agenda points, but do you guys want to introduce yourselves, anyone new or coming back, and tell us about your interest in the metaverse? Michael, seeing that I put you on the spot, you can go again. Sure. Well, metaverse I am tangentially interested in. Yeah, so I think I'm more so interested in working with Aaron a little bit on some of the GLTF standards that have been put in place um i'm very very interested in the idea of getting the gltf standard to embody uh game objects right not just renderables like meshes and transforms but you know creating open standards for basically transporting uh game objects around i think that's going to be crucial to be honest to an open metaverse to just you know allowing that portability of Basically game entities. So but yeah my background I'm I teach engineering by trade and then I dabble in everything 3d gamedev make my own games and All that good stuff. Yeah yeah that's me that's awesome great to have you here and yeah just to echo i think everyone here has a sort of a wide interest in the metaverse but in many ways tangential to things that we're doing um i'm sort of seeing the broader picture, big picture to the metaverse. So that's great to have you here. And I totally agree about the interoperability of game elements. Myself, I'm an academic and sort of from a non-IT background altogether. And just seeing the potential of games and game engines into other aspects, I think we really can work and learn more from each other, and so really happy to be in this group and do exactly that. So a big shout out to my community members. Anyone else? Ice, do you want to introduce yourself again? I don't know if you have already. You must have. Sorry, my brain. Anyone else want to have a say? Tell us about how your week's been. Anyone want to game up anything this week? Aaron, what's updates on DLTF working group? What have you guys been up to in the last week? Well, we discussed a bunch of things in the last meeting. Mostly getting everyone caught up on what the extensions are, like with Michael Jarrett and YS. And we discussed and reviewed some of the PRs that are already there, including the shape-typed audio one, which we merged, and then the physics ones are still being looked at. Well, that sounds great. Sounds like there's good steady progress there. Any other comments on GLTF working group? No. Right, then I'm trying to get Jimmy's progress on the media team that I missed again yesterday. Jimmy, do you want to chat about your work in motion thing? And if you are only on text, I can run with it. Yeah, cool. Yeah, sure. I was just thinking at the last media session that maybe we could post more of these counterparty Twitter space events, expose OMI out to a wider audience than we get on a on a discord session for instance or in one of the metaverse world hopping events or things that we've done you know"}