{"speakers": [], "chunks": [{"timestamp": [0.0, 8.72], "text": " Yeah, and then there's two things from..."}, {"timestamp": [8.72, 13.28], "text": " There's one thing from the Linux Foundation that I will read to you."}, {"timestamp": [13.7, 17.66], "text": " And I've been helping Jin with the meeting notes of the MSF thing,"}, {"timestamp": [18.56, 21.04], "text": " which has just been interesting from a..."}, {"timestamp": [21.04, 25.72], "text": " So obviously from his process and documenting and visualizing the meeting notes"}, {"timestamp": [25.72, 27.24], "text": " but it's also been an interesting thing"}, {"timestamp": [27.24, 28.86], "text": " to see what they've been talking about"}, {"timestamp": [28.86, 32.8], "text": " but I'm only about 10% through that"}, {"timestamp": [32.8, 38.14], "text": " yeah and then another thing is that"}, {"timestamp": [38.14, 41.02], "text": " I've been shaping my proposal for my research"}, {"timestamp": [41.02, 42.54], "text": " and it's been approved internally"}, {"timestamp": [42.54, 44.62], "text": " and starting to look pretty good"}, {"timestamp": [44.62, 47.72], "text": " so I've been thinking I should make a presentation to present to you guys at"}, {"timestamp": [47.72, 56.0], "text": " some point not this week yeah I think so things are exciting very very early and"}, {"timestamp": [56.0, 61.96], "text": " in brownie almost like not much visible but it just feels good you know I'm slow"}, {"timestamp": [61.96, 65.16], "text": " because that's the way the world is at the moment and messy"}, {"timestamp": [65.16, 71.44], "text": " but good. That's what's been happening in my life."}, {"timestamp": [73.12, 85.52], "text": " Um, Aaron at some point we need to do a demo about the gravity spec again. When do you need to do that?"}, {"timestamp": [86.0, 87.42], "text": " Whatever."}, {"timestamp": [89.76, 90.94], "text": " Today? Sure, we can do it today."}, {"timestamp": [92.12, 94.12], "text": " Jimmy, are you able to help"}, {"timestamp": [94.12, 96.08], "text": " record so we can screenshot"}, {"timestamp": [96.08, 97.06], "text": " some of those things?"}, {"timestamp": [99.06, 100.06], "text": " And it is"}, {"timestamp": [100.06, 102.12], "text": " recording, so hopefully we'll have the data to write"}, {"timestamp": [102.12, 102.96], "text": " that up into a blog."}, {"timestamp": [105.12, 108.08], "text": " Jimmy, are you around?"}, {"timestamp": [114.72, 120.64], "text": " Sorry the mic was off. Yes I am. I can do that and uh"}, {"timestamp": [120.64, 124.72], "text": " good. You're saying gravity sketch? Do something? Okay."}, {"timestamp": [124.72, 127.3], "text": " Cool. Sure. Yeah so this is erin"}, {"timestamp": [127.3, 135.04], "text": " i'm giving the demo of the gravity spec um to show what they have now that it's ratified so"}, {"timestamp": [135.04, 140.58], "text": " he did a demo a couple of weeks ago probably months ago by now um and then you know that"}, {"timestamp": [140.58, 145.66], "text": " was the i think 17th april recording that the data came out. Yeah, yeah, yeah."}, {"timestamp": [146.08, 146.78], "text": " Okay, perfect."}, {"timestamp": [147.0, 147.1], "text": " Great."}, {"timestamp": [147.3, 147.82], "text": " That sounds good."}, {"timestamp": [147.82, 149.84], "text": " So just record that again, take some screenshots,"}, {"timestamp": [150.3, 151.82], "text": " and then we can work it up into a blog."}, {"timestamp": [153.42, 156.08], "text": " And then if anyone else has demos or anything to show,"}, {"timestamp": [157.0, 161.24], "text": " updates from work meetings, let me know."}, {"timestamp": [162.7, 165.24], "text": " But I think let's run with Aaron whenever you're ready"}, {"timestamp": [165.24, 195.12], "text": " yeah There is one thing I'd like to put on the agenda in addition to what Aaron's doing while"}, {"timestamp": [195.12, 198.52], "text": " he's getting prepped up for it."}, {"timestamp": [198.52, 208.64], "text": " That would be, I'll find the link for it, but there's a group called Ready Player One, and they do some time."}, {"timestamp": [208.72, 210.36], "text": " They've done some stuff in here."}, {"timestamp": [210.46, 213.2], "text": " A couple of their members are part of this."}, {"timestamp": [213.2, 213.84], "text": " It's a company."}, {"timestamp": [214.0, 220.42], "text": " They're a commercial outfit, but they published a white paper, something on the metaverse,"}, {"timestamp": [220.86, 227.62], "text": " and I was wondering if that might be something for discussion and maybe invite them"}, {"timestamp": [227.62, 237.16], "text": " to do a spaces open spaces discussion of their white paper about the metaverse so I'd like to"}, {"timestamp": [237.16, 246.98], "text": " table that as a opportunity for some kind of outreach and another managed spaces call together."}, {"timestamp": [247.64, 249.0], "text": " Yeah, I think that's a great idea."}, {"timestamp": [249.08, 252.68], "text": " I really like the spaces because it was something fairly easy to organize"}, {"timestamp": [252.68, 254.94], "text": " and it works with our organic nature."}, {"timestamp": [255.04, 255.94], "text": " So that's a great idea."}, {"timestamp": [256.4, 261.14], "text": " And then that reminds me, I saw a note of Meticulac somewhere about,"}, {"timestamp": [261.74, 264.06], "text": " I think it was in Seamus Plug."}, {"timestamp": [265.76, 266.92], "text": " So Meticulak said,"}, {"timestamp": [267.02, 269.28], "text": " for anyone looking to promote their virtual world system,"}, {"timestamp": [269.48, 271.62], "text": " I've been wondering if it makes sense to look for people"}, {"timestamp": [271.62, 273.18], "text": " who run smaller Twitch channels"}, {"timestamp": [273.18, 275.94], "text": " that might be interested in playtesting on stream."}, {"timestamp": [277.1, 279.2], "text": " For the streamer, having a dev team watching you"}, {"timestamp": [279.2, 281.14], "text": " try out their work not only means a few more viewers,"}, {"timestamp": [281.32, 282.7], "text": " but also more active chatters."}, {"timestamp": [282.82, 284.54], "text": " They're likely asking questions about it."}, {"timestamp": [288.56, 292.72], "text": " And for the virtual world developer, you not only get a bit of audience from other people watching the stream but live feedback with video that can help root out any problems they run into"}, {"timestamp": [294.16, 298.24], "text": " and then it will be very important to try and avoid getting your whole metaverse game banned"}, {"timestamp": [298.24, 303.36], "text": " from twitch for content reasons like second life was but vr chat has managed to remain in the clear"}, {"timestamp": [303.36, 305.26], "text": " for a while so it's not insurmountable."}, {"timestamp": [305.64, 308.26], "text": " I think that's a great idea if we want to explore that a bit more."}, {"timestamp": [313.34, 314.76], "text": " Aaron, do you want to give me a heads up?"}, {"timestamp": [314.82, 316.12], "text": " Do you want to go right away?"}, {"timestamp": [316.28, 319.04], "text": " Should we talk about the Ready Player One"}, {"timestamp": [319.04, 322.38], "text": " white paper scheduling first?"}, {"timestamp": [322.9, 325.96], "text": " We can talk about the other things first. Okay."}, {"timestamp": [326.38, 327.34], "text": " Give you a couple of meetings."}, {"timestamp": [327.98, 330.44], "text": " I'm totally good to do"}, {"timestamp": [330.44, 332.16], "text": " it today, but I did just wake up, so"}, {"timestamp": [332.16, 334.44], "text": " any delay is going to get me"}, {"timestamp": [334.44, 335.56], "text": " more into the"}, {"timestamp": [335.56, 337.66], "text": " awake mood. Okay."}, {"timestamp": [338.8, 340.56], "text": " Yeah, that's fine."}, {"timestamp": [340.64, 342.12], "text": " Let's catch up a bit, let's say"}, {"timestamp": [342.12, 343.86], "text": " 15 minutes from now would be"}, {"timestamp": [343.86, 345.3], "text": " a good time."}, {"timestamp": [345.58, 346.8], "text": " Yeah."}, {"timestamp": [347.14, 348.38], "text": " Awesome."}, {"timestamp": [352.14, 355.36], "text": " Okay, so, Jermaine, do you want to chat about... Okay, Jermaine shared the link in the chat."}, {"timestamp": [356.66, 359.66], "text": " I hope you want to release the white paper calling for better interoperability."}, {"timestamp": [360.74, 362.18], "text": " Okay, so what do we think?"}, {"timestamp": [364.62, 368.0], "text": " Do we want to do it tomorrow or next week?"}, {"timestamp": [371.0, 373.0], "text": " What's your thinking?"}, {"timestamp": [377.0, 379.0], "text": " Are y'all talking about the white paper?"}, {"timestamp": [392.02, 396.44], "text": " Yeah, so I think the suggestion is having a spaces like we did with the Kronospec and invite them to talk about their white paper in a casual conversation."}, {"timestamp": [396.44, 398.68], "text": " Why don't we just go to their event?"}, {"timestamp": [398.68, 407.74], "text": " It's in a couple hours and you can just talk to them directly in the app itself yeah I think"}, {"timestamp": [407.74, 415.18], "text": " both of those is a good idea I they have something coming up right now"}, {"timestamp": [417.22, 422.88], "text": " good yes it's an own general it's in a couple hours"}, {"timestamp": [421.16, 425.04], "text": " It's in a couple hours."}, {"timestamp": [425.56, 426.16], "text": " Okay."}, {"timestamp": [426.44, 427.4], "text": " Yeah."}, {"timestamp": [434.96, 435.22], "text": " So I think I'll try and attend that and see if I can set up a – okay."}, {"timestamp": [435.84, 439.18], "text": " Yeah, yeah, good."}, {"timestamp": [447.96, 452.12], "text": " So this white paper, is there any way to look at the white paper without submitting a name, an email address, and presumably getting spam? Yeah, I did notice that that was"}, {"timestamp": [452.12, 455.84], "text": " there. Hang on, I'll pop it on the whole thing."}, {"timestamp": [455.94, 460.16], "text": " It's a little old school, their system towards"}, {"timestamp": [460.16, 460.48], "text": " that."}, {"timestamp": [462.0, 468.0], "text": " towards that."}, {"timestamp": [476.0, 488.28], "text": " It also, and what made me think about it, again, I had who's, you know, he joins in occasionally."}, {"timestamp": [488.5, 492.3], "text": " He's been an off and on contributor to OMI for quite a while."}, {"timestamp": [493.64, 499.48], "text": " He also had some comments on it, and I think it produced some interest for him."}, {"timestamp": [499.72, 503.94], "text": " It's sort of, you know, they make a proposal, and they talk about standards."}, {"timestamp": [504.18, 505.76], "text": " They talk about interoperability"}, {"timestamp": [506.32, 513.28], "text": " and that was why i thought it matches sort of this community's direction of travel"}, {"timestamp": [515.36, 521.92], "text": " uh and this exactly what indy said we can do it the way that it was done with the kronos group"}, {"timestamp": [521.92, 526.24], "text": " guys you know so in addition to maybe i'll have a look at this thing"}, {"timestamp": [527.12, 531.12], "text": " uh you know we can any of us attend this after party thing they have these open"}, {"timestamp": [531.12, 540.8], "text": " i've been to a couple of their uh open planet sort of you know drop in it's webexr browser based"}, {"timestamp": [540.8, 545.94], "text": " there is some registration involved where you know i don I don't know, I didn't RSVP"}, {"timestamp": [545.94, 546.78], "text": " or anything, but"}, {"timestamp": [546.78, 549.96], "text": " it's linked, it's followed"}, {"timestamp": [549.96, 551.6], "text": " the link, you don't have to download anything."}, {"timestamp": [552.3, 552.78], "text": " And"}, {"timestamp": [552.78, 556.1], "text": " maybe set up"}, {"timestamp": [556.1, 558.16], "text": " a spaces, the same"}, {"timestamp": [558.16, 559.74], "text": " thing that we did with"}, {"timestamp": [559.74, 561.22], "text": " Kronos Group."}, {"timestamp": [561.84, 563.98], "text": " And just do it, you know, announce it a couple"}, {"timestamp": [563.98, 567.0], "text": " days in advance and do an open space on it."}, {"timestamp": [576.0, 582.0], "text": " I think it's a good idea to try and attend the event that's in a couple of hours and then have the spaces done."}, {"timestamp": [582.0, 592.24], "text": " I'm just mirroring what Jimmy says because I think that they'll cover different needs and maybe get Kainé in that space if he's keen. I've"}, {"timestamp": [592.24, 598.52], "text": " been chatting to Kainé basically every day. He's just taken up martial arts and that conflicts"}, {"timestamp": [598.52, 612.0], "text": " with his meeting. So he's still around, he's just not attending."}, {"timestamp": [617.0, 622.0], "text": " Gary says that RP1, or Ready Player One, seems to focus on the development of scalability. And from the quick tweet that I've seen that Kayneve retweeted,"}, {"timestamp": [622.0, 626.08], "text": " you also seem to think it's basically a..."}, {"timestamp": [626.08, 628.2], "text": " It's essentially a call for interoperability."}, {"timestamp": [630.52, 631.44], "text": " That's interesting."}, {"timestamp": [633.28, 634.4], "text": " It all comes down to scale."}], "text": " Yeah, and then there's two things from... There's one thing from the Linux Foundation that I will read to you. And I've been helping Jin with the meeting notes of the MSF thing, which has just been interesting from a... So obviously from his process and documenting and visualizing the meeting notes but it's also been an interesting thing to see what they've been talking about but I'm only about 10% through that yeah and then another thing is that I've been shaping my proposal for my research and it's been approved internally and starting to look pretty good so I've been thinking I should make a presentation to present to you guys at some point not this week yeah I think so things are exciting very very early and in brownie almost like not much visible but it just feels good you know I'm slow because that's the way the world is at the moment and messy but good. That's what's been happening in my life. Um, Aaron at some point we need to do a demo about the gravity spec again. When do you need to do that? Whatever. Today? Sure, we can do it today. Jimmy, are you able to help record so we can screenshot some of those things? And it is recording, so hopefully we'll have the data to write that up into a blog. Jimmy, are you around? Sorry the mic was off. Yes I am. I can do that and uh good. You're saying gravity sketch? Do something? Okay. Cool. Sure. Yeah so this is erin i'm giving the demo of the gravity spec um to show what they have now that it's ratified so he did a demo a couple of weeks ago probably months ago by now um and then you know that was the i think 17th april recording that the data came out. Yeah, yeah, yeah. Okay, perfect. Great. That sounds good. So just record that again, take some screenshots, and then we can work it up into a blog. And then if anyone else has demos or anything to show, updates from work meetings, let me know. But I think let's run with Aaron whenever you're ready yeah There is one thing I'd like to put on the agenda in addition to what Aaron's doing while he's getting prepped up for it. That would be, I'll find the link for it, but there's a group called Ready Player One, and they do some time. They've done some stuff in here. A couple of their members are part of this. It's a company. They're a commercial outfit, but they published a white paper, something on the metaverse, and I was wondering if that might be something for discussion and maybe invite them to do a spaces open spaces discussion of their white paper about the metaverse so I'd like to table that as a opportunity for some kind of outreach and another managed spaces call together. Yeah, I think that's a great idea. I really like the spaces because it was something fairly easy to organize and it works with our organic nature. So that's a great idea. And then that reminds me, I saw a note of Meticulac somewhere about, I think it was in Seamus Plug. So Meticulak said, for anyone looking to promote their virtual world system, I've been wondering if it makes sense to look for people who run smaller Twitch channels that might be interested in playtesting on stream. For the streamer, having a dev team watching you try out their work not only means a few more viewers, but also more active chatters. They're likely asking questions about it. And for the virtual world developer, you not only get a bit of audience from other people watching the stream but live feedback with video that can help root out any problems they run into and then it will be very important to try and avoid getting your whole metaverse game banned from twitch for content reasons like second life was but vr chat has managed to remain in the clear for a while so it's not insurmountable. I think that's a great idea if we want to explore that a bit more. Aaron, do you want to give me a heads up? Do you want to go right away? Should we talk about the Ready Player One white paper scheduling first? We can talk about the other things first. Okay. Give you a couple of meetings. I'm totally good to do it today, but I did just wake up, so any delay is going to get me more into the awake mood. Okay. Yeah, that's fine. Let's catch up a bit, let's say 15 minutes from now would be a good time. Yeah. Awesome. Okay, so, Jermaine, do you want to chat about... Okay, Jermaine shared the link in the chat. I hope you want to release the white paper calling for better interoperability. Okay, so what do we think? Do we want to do it tomorrow or next week? What's your thinking? Are y'all talking about the white paper? Yeah, so I think the suggestion is having a spaces like we did with the Kronospec and invite them to talk about their white paper in a casual conversation. Why don't we just go to their event? It's in a couple hours and you can just talk to them directly in the app itself yeah I think both of those is a good idea I they have something coming up right now good yes it's an own general it's in a couple hours It's in a couple hours. Okay. Yeah. So I think I'll try and attend that and see if I can set up a – okay. Yeah, yeah, good. So this white paper, is there any way to look at the white paper without submitting a name, an email address, and presumably getting spam? Yeah, I did notice that that was there. Hang on, I'll pop it on the whole thing. It's a little old school, their system towards that. towards that. It also, and what made me think about it, again, I had who's, you know, he joins in occasionally. He's been an off and on contributor to OMI for quite a while. He also had some comments on it, and I think it produced some interest for him. It's sort of, you know, they make a proposal, and they talk about standards. They talk about interoperability and that was why i thought it matches sort of this community's direction of travel uh and this exactly what indy said we can do it the way that it was done with the kronos group guys you know so in addition to maybe i'll have a look at this thing uh you know we can any of us attend this after party thing they have these open i've been to a couple of their uh open planet sort of you know drop in it's webexr browser based there is some registration involved where you know i don I don't know, I didn't RSVP or anything, but it's linked, it's followed the link, you don't have to download anything. And maybe set up a spaces, the same thing that we did with Kronos Group. And just do it, you know, announce it a couple days in advance and do an open space on it. I think it's a good idea to try and attend the event that's in a couple of hours and then have the spaces done. I'm just mirroring what Jimmy says because I think that they'll cover different needs and maybe get Kainé in that space if he's keen. I've been chatting to Kainé basically every day. He's just taken up martial arts and that conflicts with his meeting. So he's still around, he's just not attending. Gary says that RP1, or Ready Player One, seems to focus on the development of scalability. And from the quick tweet that I've seen that Kayneve retweeted, you also seem to think it's basically a... It's essentially a call for interoperability. That's interesting. It all comes down to scale."}