{"speakers": [], "chunks": [{"timestamp": [0.0, 4.96], "text": " Yeah, so it's just, anyway, let's start from the top."}, {"timestamp": [5.16, 11.62], "text": " Welcome, it is the Open Metaverse Interoperability Group Weekly Meeting number 170."}, {"timestamp": [12.6, 14.16], "text": " Can't believe tomorrow is August already."}, {"timestamp": [15.94, 20.16], "text": " Yeah, we're here shooting the breeze about the Metaverse and talking about all things"}, {"timestamp": [20.16, 22.32], "text": " indie and Metaverse related."}, {"timestamp": [23.14, 28.06], "text": " Feel free to introduce yourself. YS Ice, I don't know how"}, {"timestamp": [28.06, 33.36], "text": " you want to pronounce your nick. You were here last week as well and last week was very"}, {"timestamp": [33.36, 37.68], "text": " busy. Do you want to tell us who you are? Welcome."}, {"timestamp": [40.42, 41.06], "text": " Hello."}, {"timestamp": [41.64, 42.0], "text": " Hey."}, {"timestamp": [41.08, 41.68], "text": " Hello."}, {"timestamp": [42.0, 42.92], "text": " Hey."}, {"timestamp": [57.0, 59.0], "text": " Yeah, I met Aaron recently because I was making a Blender add-on to make levels and make... To make..."}, {"timestamp": [59.64, 68.84], "text": " So, like, you can make stuff in Blender and then put it in godot and then it works basically"}, {"timestamp": [68.84, 77.18], "text": " awesome welcome um and i can't remember but did you say you wanted to show a demo at some point"}, {"timestamp": [77.18, 87.86], "text": " can't remember where i saw you oh no that i i haven't got any demos to show, sorry. I know, you were just having a chat on Discord."}, {"timestamp": [88.02, 90.38], "text": " So that's great. Welcome. Good to have you here."}, {"timestamp": [91.14, 91.44], "text": " Thanks."}, {"timestamp": [91.44, 94.46], "text": " Oh goodness, I've missed the message."}, {"timestamp": [94.98, 96.86], "text": " Welcome everybody."}, {"timestamp": [97.56, 100.62], "text": " Does anyone want to reintroduce themselves?"}, {"timestamp": [100.9, 102.22], "text": " Tell me about anything interesting."}, {"timestamp": [103.54, 109.62], "text": " We can jump into some updates over the past couple of weeks in a second"}, {"timestamp": [109.62, 113.16], "text": " how you guys been"}, {"timestamp": [127.0, 130.0], "text": " Seacraft is happening at the moment isn't it? Who is attending?"}, {"timestamp": [148.74, 149.32], "text": " Clearly nobody who is also attending this meeting."}, {"timestamp": [150.66, 150.9], "text": " Keyframe, what's up, man?"}, {"timestamp": [151.74, 152.68], "text": " You've been busy."}, {"timestamp": [153.62, 153.66], "text": " Yeah, I have."}, {"timestamp": [154.34, null], "text": " Can you hear me okay?"}], "text": " Yeah, so it's just, anyway, let's start from the top. Welcome, it is the Open Metaverse Interoperability Group Weekly Meeting number 170. Can't believe tomorrow is August already. Yeah, we're here shooting the breeze about the Metaverse and talking about all things indie and Metaverse related. Feel free to introduce yourself. YS Ice, I don't know how you want to pronounce your nick. You were here last week as well and last week was very busy. Do you want to tell us who you are? Welcome. Hello. Hey. Hello. Hey. Yeah, I met Aaron recently because I was making a Blender add-on to make levels and make... To make... So, like, you can make stuff in Blender and then put it in godot and then it works basically awesome welcome um and i can't remember but did you say you wanted to show a demo at some point can't remember where i saw you oh no that i i haven't got any demos to show, sorry. I know, you were just having a chat on Discord. So that's great. Welcome. Good to have you here. Thanks. Oh goodness, I've missed the message. Welcome everybody. Does anyone want to reintroduce themselves? Tell me about anything interesting. We can jump into some updates over the past couple of weeks in a second how you guys been Seacraft is happening at the moment isn't it? Who is attending? Clearly nobody who is also attending this meeting. Keyframe, what's up, man? You've been busy. Yeah, I have. Can you hear me okay?"}