{"speakers": [], "chunks": [{"timestamp": [0.0, 30.96], "text": " Cool. All right."}, {"timestamp": [31.96, 36.84], "text": " Welcome, everybody, to another exciting week of OMI."}, {"timestamp": [37.48, 40.58], "text": " We are the Open Metaverse Interoperability Group."}, {"timestamp": [40.58, 49.4], "text": " We are aligned with the W3C and have a group there as well, which folks are able to join."}, {"timestamp": [49.4, 56.02], "text": " We participate here in Discord every Wednesday, and you are joining us here for essentially our"}, {"timestamp": [56.02, 62.84], "text": " weekly communal gathering. There are many other OMI meetings. Sometimes we have demo days."}, {"timestamp": [63.42, 66.08], "text": " Our working groups, such the gltf working group"}, {"timestamp": [66.8, 71.52], "text": " and our media group have their own meeting cadences and we all choose to come together"}, {"timestamp": [71.52, 77.92], "text": " because we believe that the metaverse should be and is by definition interoperable so we work"}, {"timestamp": [77.92, 90.08], "text": " together to help champion and codify standards that make this possible. We are community-ran and donor-driven, so we do not have"}, {"timestamp": [90.08, 96.98], "text": " any requirements for folks to pay any yearly fees in order to participate here. And we do have real"}, {"timestamp": [96.98, 109.38], "text": " seats and real influence elsewhere that allows us to make actual formal recommendations, whether folks are keen to adopt them or not, is part of our"}, {"timestamp": [109.38, 117.06], "text": " mission. So, all right, so welcome. And generally what we like to do is do some check-ins with our"}, {"timestamp": [117.06, 122.22], "text": " working groups. But before that, I love giving time for introductions, something we used to do"}, {"timestamp": [122.22, 125.24], "text": " a lot in the early days. So if this is your first time"}, {"timestamp": [125.24, 130.96], "text": " joining us, feel free to say maybe who you are, what brought you to OMI today, and if you're with"}, {"timestamp": [130.96, 147.44], "text": " a group, what group you're with. All right, so if you've been here before, which looks like everybody here has,"}, {"timestamp": [147.54, 172.68], "text": " and you want to reintroduce yourself, now is a good time for that. All right."}, {"timestamp": [172.88, 174.06], "text": " Let's go ahead and dive in."}, {"timestamp": [174.06, 178.7], "text": " So first things first, what we'll do is do some quick working group check-ins."}, {"timestamp": [179.66, 181.66], "text": " We'll start with the GLTF subgroup."}, {"timestamp": [181.78, 190.58], "text": " Do we have any updates from the GLTF working group?"}, {"timestamp": [191.8, 192.06], "text": " Not in the past week."}, {"timestamp": [193.84, 198.28], "text": " It was a pretty slow meeting last week."}, {"timestamp": [199.12, 199.32], "text": " Cool, cool."}, {"timestamp": [199.7, 199.88], "text": " All right."}, {"timestamp": [201.26, 201.36], "text": " Let's move on to the media team."}, {"timestamp": [202.84, 207.48], "text": " Any major updates from the media group?"}, {"timestamp": [211.78, 212.26], "text": " I don't see anyone else here right now, but none that I know of."}, {"timestamp": [212.52, 212.82], "text": " Okay."}, {"timestamp": [213.12, 232.06], "text": " Okay. And from our general community, is there anything that we should be informing our media team of to maybe help cross post or get the word out."}, {"timestamp": [232.9, 236.24], "text": " All right, great. So I've been writing some articles myself,"}, {"timestamp": [236.24, 240.24], "text": " which I think generally it looks like folks do cross-post,"}, {"timestamp": [240.24, 241.32], "text": " so I do appreciate that,"}, {"timestamp": [241.32, 244.28], "text": " but I'm gonna try to keep some content coming"}, {"timestamp": [244.28, 247.4], "text": " in various places like LinkedIn and Twitter."}, {"timestamp": [248.24, 254.42], "text": " And of course, on my my sub stack. So I'll try to keep it coming when it's really relevant."}, {"timestamp": [254.7, 258.2], "text": " I'll inform the media team and I encourage everyone else to do the same thing."}, {"timestamp": [258.82, 265.34], "text": " I keep saying I want to get my videos going again. It is on my list and i'll do it soon but once i start getting videos going"}, {"timestamp": [265.34, 272.1], "text": " i'd love to do some um interviews again of folks in this community what you're working on uh and"}, {"timestamp": [272.1, 276.86], "text": " what folks should be paying attention to as it relates to you know the metaverse and interoperability"}, {"timestamp": [276.86, 285.22], "text": " today um it is all again volunteer driven so um just stand by um okay"}], "text": " Cool. All right. Welcome, everybody, to another exciting week of OMI. We are the Open Metaverse Interoperability Group. We are aligned with the W3C and have a group there as well, which folks are able to join. We participate here in Discord every Wednesday, and you are joining us here for essentially our weekly communal gathering. There are many other OMI meetings. Sometimes we have demo days. Our working groups, such the gltf working group and our media group have their own meeting cadences and we all choose to come together because we believe that the metaverse should be and is by definition interoperable so we work together to help champion and codify standards that make this possible. We are community-ran and donor-driven, so we do not have any requirements for folks to pay any yearly fees in order to participate here. And we do have real seats and real influence elsewhere that allows us to make actual formal recommendations, whether folks are keen to adopt them or not, is part of our mission. So, all right, so welcome. And generally what we like to do is do some check-ins with our working groups. But before that, I love giving time for introductions, something we used to do a lot in the early days. So if this is your first time joining us, feel free to say maybe who you are, what brought you to OMI today, and if you're with a group, what group you're with. All right, so if you've been here before, which looks like everybody here has, and you want to reintroduce yourself, now is a good time for that. All right. Let's go ahead and dive in. So first things first, what we'll do is do some quick working group check-ins. We'll start with the GLTF subgroup. Do we have any updates from the GLTF working group? Not in the past week. It was a pretty slow meeting last week. Cool, cool. All right. Let's move on to the media team. Any major updates from the media group? I don't see anyone else here right now, but none that I know of. Okay. Okay. And from our general community, is there anything that we should be informing our media team of to maybe help cross post or get the word out. All right, great. So I've been writing some articles myself, which I think generally it looks like folks do cross-post, so I do appreciate that, but I'm gonna try to keep some content coming in various places like LinkedIn and Twitter. And of course, on my my sub stack. So I'll try to keep it coming when it's really relevant. I'll inform the media team and I encourage everyone else to do the same thing. I keep saying I want to get my videos going again. It is on my list and i'll do it soon but once i start getting videos going i'd love to do some um interviews again of folks in this community what you're working on uh and what folks should be paying attention to as it relates to you know the metaverse and interoperability today um it is all again volunteer driven so um just stand by um okay"}