{"speakers": [], "chunks": [{"timestamp": [0.0, 7.06], "text": " There's a lot going on in Apple also, and that's on the tail end of, you know, there's"}, {"timestamp": [7.06, 10.24], "text": " all these events back to back now, it seems like."}, {"timestamp": [10.24, 14.64], "text": " Yeah, I think June is conference season."}, {"timestamp": [14.64, 20.66], "text": " And I saw there was a lot of comments about Apple, but I think a lot of it was sort of"}, {"timestamp": [20.66, 21.66], "text": " disappointing."}, {"timestamp": [21.66, 27.14], "text": " Is that the feeling you're getting?"}, {"timestamp": [35.1, 50.3], "text": " They seem to be doubling down on WebXR, which is an improvement. That's good, I think. But on the whole, there's not like no new headsets announced. And I'm not paying attention to a lot of the other stuff, but just on the AVP, it's some good quality of life enhancements."}, {"timestamp": [50.46, 55.24], "text": " But again, nothing that's going to reverse the sales trend, I think, at this point."}, {"timestamp": [55.52, 57.64], "text": " They're opening up a few new countries and stuff."}, {"timestamp": [57.8, 62.86], "text": " They added faster hand tracking and things, but nothing revolutionary."}, {"timestamp": [62.86, 67.22], "text": " But I think you're going to see more and more people building apps,"}, {"timestamp": [67.68, 69.9], "text": " and those apps are going to look better and better,"}, {"timestamp": [70.14, 72.48], "text": " and that's going to have a snowball effect,"}, {"timestamp": [73.36, 75.3], "text": " maybe a slow-rolling snowball effect,"}, {"timestamp": [75.36, 78.1], "text": " but it's going to have a snowball effect is my feeling."}, {"timestamp": [79.88, 83.42], "text": " Well, I guess iterative innovation is still better than no innovation."}, {"timestamp": [86.08, 91.52], "text": " Where were you last week? Well Or not last week, this week. I think we missed each other with"}, {"timestamp": [91.52, 94.56], "text": " the media stuff. I saw you online later, but I had a couple of things to do."}, {"timestamp": [96.64, 101.6], "text": " Yeah, I was double booked and I actually may have to run away. I'm not sure I can do this"}, {"timestamp": [101.6, 112.16], "text": " entire thing. There's a Unity session going on right now for some xr guys getting together and so i i may i i kind of got to keep an eye on that in case they"}, {"timestamp": [113.28, 118.64], "text": " end early i think it'll go longer than this meeting but the you know again it's like you"}, {"timestamp": [118.64, 125.88], "text": " said it's some sort of some sort of all at once or none at all sort of story with regards to events taking place."}, {"timestamp": [127.38, 129.84], "text": " Yeah, please, by all means, go check in there."}, {"timestamp": [130.7, 133.82], "text": " Is there anything on that maybe we should focus on?"}, {"timestamp": [133.9, 137.06], "text": " But is there anything important that needs to be shared this week?"}, {"timestamp": [137.1, 142.1], "text": " I didn't even spin up an agenda properly because I've been busy as hell,"}, {"timestamp": [142.24, 144.04], "text": " but did make my deadline on Monday."}, {"timestamp": [144.68, 146.88], "text": " And I'm pretty proud of the work I did."}, {"timestamp": [147.02, 149.7], "text": " So thumbs crossed that anyone can do money."}, {"timestamp": [152.18, 152.74], "text": " Congratulations."}, {"timestamp": [153.34, 153.46], "text": " Yeah."}, {"timestamp": [154.26, 160.18], "text": " MTV was talking about needing maybe access to that recordings directory"}, {"timestamp": [160.18, 163.94], "text": " so that he can dump stuff that he's got on Firefly."}, {"timestamp": [164.12, 165.88], "text": " I think he's been trying to do that for a little while,"}, {"timestamp": [165.96, 167.76], "text": " but it should just add up."}, {"timestamp": [167.9, 169.88], "text": " I'm not sure the overlap he has"}, {"timestamp": [169.88, 174.62], "text": " with what Jen already is using as a knowledge base for now."}, {"timestamp": [176.0, 178.66], "text": " Ooh, maybe he's got a transcript of 17th of April."}, {"timestamp": [179.62, 180.72], "text": " I asked him."}, {"timestamp": [181.02, 182.88], "text": " 17th of April, I did ask him."}, {"timestamp": [183.6, 184.26], "text": " Okay, cool."}, {"timestamp": [184.98, 186.86], "text": " Great, I'll send him an invite straight away."}, {"timestamp": [187.4, 190.6], "text": " Any news from anyone else? Anything urgent or important happening?"}, {"timestamp": [190.9, 211.68], "text": " Or just in general? you"}, {"timestamp": [217.4, 229.2], "text": " okay I see Aaron's not here so I don't know about GLTF updates but just to follow up from that and maybe if someone can give advice I suppose. So I've been wanting to write a blog post about the glTF"}, {"timestamp": [230.32, 235.12], "text": " gravity spec that's recently been merged and I thought that would be quite easy to do because"}, {"timestamp": [235.12, 241.68], "text": " we had a short screencast recording from the 17th of April community meeting and he did a very nice"}, {"timestamp": [241.68, 250.68], "text": " demo there and so I thought I could just take that transcript and draft that into a blog and then go back and ask him if"}, {"timestamp": [250.68, 255.84], "text": " that's good and you know the GLTF group can edit it rather than start from"}, {"timestamp": [255.84, 261.54], "text": " scratch but that audio file or the audio file was corrupted and so we only"}, {"timestamp": [261.54, 266.96], "text": " have the first 20 or so minutes so I was wondering if maybe you would want to demo again"}, {"timestamp": [266.96, 270.78], "text": " or if there's a different way to just get the bulk of the text"}, {"timestamp": [270.78, 272.3], "text": " to do it more efficiently."}, {"timestamp": [273.48, 298.28], "text": " So any advice from anyone there? I haven't heard any new information on that front from Aaron either, but I'd be happy"}, {"timestamp": [298.28, 305.96], "text": " to bring it up tomorrow at the GLTF meeting and see what kind of synergy we can figure out because I know that there"}, {"timestamp": [305.96, 307.08], "text": " is an active interest in"}, {"timestamp": [307.08, 309.76], "text": " drawing an open"}, {"timestamp": [309.76, 311.98], "text": " call to participation kind of to help"}, {"timestamp": [311.98, 313.96], "text": " review the gravity spec and make"}, {"timestamp": [313.96, 315.38], "text": " it advance further."}, {"timestamp": [316.68, 317.62], "text": " Awesome, thanks."}, {"timestamp": [317.96, 319.6], "text": " And if there's maybe a"}, {"timestamp": [319.6, 321.94], "text": " place where you sort of summarized"}, {"timestamp": [321.94, 323.34], "text": " or discussed it on the"}, {"timestamp": [323.34, 325.98], "text": " channel, then just tag me there. I get lost discuss it on the channel then just tag me there"}, {"timestamp": [325.98, 327.98], "text": " I get lost in the technical stuff and"}, {"timestamp": [328.94, 333.04], "text": " To just tag me like, you know, we figure something out as we go. Thanks"}, {"timestamp": [337.46, 341.34], "text": " Okay, I had a look and I think MTV is it does have"}, {"timestamp": [342.74, 348.76], "text": " Access to the all the repositories so you so you should have access to the recordings one."}, {"timestamp": [351.06, 355.34], "text": " Okay, I'll send them a link then. If I didn't, I'll just double check. Thanks."}], "text": " There's a lot going on in Apple also, and that's on the tail end of, you know, there's all these events back to back now, it seems like. Yeah, I think June is conference season. And I saw there was a lot of comments about Apple, but I think a lot of it was sort of disappointing. Is that the feeling you're getting? They seem to be doubling down on WebXR, which is an improvement. That's good, I think. But on the whole, there's not like no new headsets announced. And I'm not paying attention to a lot of the other stuff, but just on the AVP, it's some good quality of life enhancements. But again, nothing that's going to reverse the sales trend, I think, at this point. They're opening up a few new countries and stuff. They added faster hand tracking and things, but nothing revolutionary. But I think you're going to see more and more people building apps, and those apps are going to look better and better, and that's going to have a snowball effect, maybe a slow-rolling snowball effect, but it's going to have a snowball effect is my feeling. Well, I guess iterative innovation is still better than no innovation. Where were you last week? Well Or not last week, this week. I think we missed each other with the media stuff. I saw you online later, but I had a couple of things to do. Yeah, I was double booked and I actually may have to run away. I'm not sure I can do this entire thing. There's a Unity session going on right now for some xr guys getting together and so i i may i i kind of got to keep an eye on that in case they end early i think it'll go longer than this meeting but the you know again it's like you said it's some sort of some sort of all at once or none at all sort of story with regards to events taking place. Yeah, please, by all means, go check in there. Is there anything on that maybe we should focus on? But is there anything important that needs to be shared this week? I didn't even spin up an agenda properly because I've been busy as hell, but did make my deadline on Monday. And I'm pretty proud of the work I did. So thumbs crossed that anyone can do money. Congratulations. Yeah. MTV was talking about needing maybe access to that recordings directory so that he can dump stuff that he's got on Firefly. I think he's been trying to do that for a little while, but it should just add up. I'm not sure the overlap he has with what Jen already is using as a knowledge base for now. Ooh, maybe he's got a transcript of 17th of April. I asked him. 17th of April, I did ask him. Okay, cool. Great, I'll send him an invite straight away. Any news from anyone else? Anything urgent or important happening? Or just in general? you okay I see Aaron's not here so I don't know about GLTF updates but just to follow up from that and maybe if someone can give advice I suppose. So I've been wanting to write a blog post about the glTF gravity spec that's recently been merged and I thought that would be quite easy to do because we had a short screencast recording from the 17th of April community meeting and he did a very nice demo there and so I thought I could just take that transcript and draft that into a blog and then go back and ask him if that's good and you know the GLTF group can edit it rather than start from scratch but that audio file or the audio file was corrupted and so we only have the first 20 or so minutes so I was wondering if maybe you would want to demo again or if there's a different way to just get the bulk of the text to do it more efficiently. So any advice from anyone there? I haven't heard any new information on that front from Aaron either, but I'd be happy to bring it up tomorrow at the GLTF meeting and see what kind of synergy we can figure out because I know that there is an active interest in drawing an open call to participation kind of to help review the gravity spec and make it advance further. Awesome, thanks. And if there's maybe a place where you sort of summarized or discussed it on the channel, then just tag me there. I get lost discuss it on the channel then just tag me there I get lost in the technical stuff and To just tag me like, you know, we figure something out as we go. Thanks Okay, I had a look and I think MTV is it does have Access to the all the repositories so you so you should have access to the recordings one. Okay, I'll send them a link then. If I didn't, I'll just double check. Thanks."}