{"speakers": [], "chunks": [{"timestamp": [0.0, 14.4], "text": " Hi everyone, so this is the Open Metaverse Interoperability Group weekly community meeting"}, {"timestamp": [14.4, 18.64], "text": " where we sometimes have an agenda and sometimes just chat and shoot the breeze."}, {"timestamp": [18.8, 26.04], "text": " We love seeing demos from people and so we just do all sorts of things catch up on what the"}, {"timestamp": [26.04, 29.06], "text": " different working groups have been doing and what people have been doing in their"}, {"timestamp": [29.06, 37.88], "text": " lives so if you're new here or you want to share what you're doing please feel"}, {"timestamp": [37.88, 42.08], "text": " free to introduce yourself you can do so via voice or text we'll read it out for"}, {"timestamp": [42.08, 45.28], "text": " the sake of the recording."}, {"timestamp": [47.68, 50.62], "text": " And yeah, welcome. Glad to have you here."}, {"timestamp": [52.08, 52.28], "text": " So I see Dogman's new."}, {"timestamp": [56.12, 60.02], "text": " Do you want to say how you got here? I already know that you can't use voice, so you're welcome to chat. And anyone"}, {"timestamp": [60.02, 63.86], "text": " else want to share what you've been up to in the past week?"}, {"timestamp": [64.54, 65.82], "text": " Mr. Metaverse just shared what he's been up to in the past week? Mr. Medivir's just shared"}, {"timestamp": [65.82, 70.06], "text": " what he's been busy with. He's been buuusy. But it sounds really cool and it sounds like"}, {"timestamp": [70.06, 98.82], "text": " the game in Godot think we can check in."}, {"timestamp": [98.82, 100.84], "text": " If anyone's got a demo, you're welcome."}, {"timestamp": [101.66, 107.92], "text": " I see the GLTF group has been very busy and ice you've been um sharing"}, {"timestamp": [107.92, 114.9], "text": " it was some really cool thing um i don't i don't understand much of it do you want to"}, {"timestamp": [114.9, 126.32], "text": " tell us what you've been up to hello yes um i've been working on a level editor add-on for Blender"}, {"timestamp": [126.32, 128.28], "text": " and"}, {"timestamp": [128.28, 132.2], "text": " part of that was"}, {"timestamp": [132.2, 134.76], "text": " well the motivation for making"}, {"timestamp": [134.76, 135.92], "text": " a level editor"}, {"timestamp": [135.92, 138.34], "text": " add-on was I was using"}, {"timestamp": [138.34, 139.22], "text": " Trench Broom"}, {"timestamp": [139.22, 141.22], "text": " which is like a"}, {"timestamp": [141.22, 144.0], "text": " retro level editor for"}, {"timestamp": [144.0, 145.12], "text": " Quake games using like volumes which is like a retro level editor for Quake games,"}, {"timestamp": [146.16, 151.66], "text": " using volumes, which is like meshes, basically, convex volumes."}, {"timestamp": [156.76, 162.38], "text": " So while getting into this, I met with Aaron Frank,"}, {"timestamp": [162.46, 168.02], "text": " who showed me the OMI specs, and that's how I ended up coming"}, {"timestamp": [168.02, 175.98], "text": " here because I had no idea about it and then not now I've implemented the OMI spec into"}, {"timestamp": [175.98, 187.84], "text": " blender so I've got like a oh I can demo this is should I like share my screen or is yes"}], "text": " Hi everyone, so this is the Open Metaverse Interoperability Group weekly community meeting where we sometimes have an agenda and sometimes just chat and shoot the breeze. We love seeing demos from people and so we just do all sorts of things catch up on what the different working groups have been doing and what people have been doing in their lives so if you're new here or you want to share what you're doing please feel free to introduce yourself you can do so via voice or text we'll read it out for the sake of the recording. And yeah, welcome. Glad to have you here. So I see Dogman's new. Do you want to say how you got here? I already know that you can't use voice, so you're welcome to chat. And anyone else want to share what you've been up to in the past week? Mr. Metaverse just shared what he's been up to in the past week? Mr. Medivir's just shared what he's been busy with. He's been buuusy. But it sounds really cool and it sounds like the game in Godot think we can check in. If anyone's got a demo, you're welcome. I see the GLTF group has been very busy and ice you've been um sharing it was some really cool thing um i don't i don't understand much of it do you want to tell us what you've been up to hello yes um i've been working on a level editor add-on for Blender and part of that was well the motivation for making a level editor add-on was I was using Trench Broom which is like a retro level editor for Quake games using like volumes which is like a retro level editor for Quake games, using volumes, which is like meshes, basically, convex volumes. So while getting into this, I met with Aaron Frank, who showed me the OMI specs, and that's how I ended up coming here because I had no idea about it and then not now I've implemented the OMI spec into blender so I've got like a oh I can demo this is should I like share my screen or is yes"}