{"speakers": [], "chunks": [{"timestamp": [0.0, 16.72], "text": " Okay, welcome everyone. This is meeting 158. Let me share my screen. Mr. Medibose can't make it today because he is on some fancy networking thing or something. I saw it on Twitter."}, {"timestamp": [18.44, 27.96], "text": " And Jimmy is here, but only I think in spirit because he's off traveling. So I did make notes of the things that was busy."}, {"timestamp": [28.82, 30.68], "text": " Hi, I'm Beldum. That's what someone asked me."}, {"timestamp": [31.64, 38.98], "text": " Alright, so welcome to meeting 158 of the Open Metaverse Interoperability Group."}, {"timestamp": [39.54, 48.92], "text": " We're a bunch of indies and grassroots people and just people passionate about building the metaverse in whichever ways we are comfortable with."}, {"timestamp": [49.8, 56.08], "text": " If you're new here and you would like to introduce yourself, you can do it now on voice or on text."}, {"timestamp": [56.18, 57.92], "text": " Anyway, you feel comfortable."}, {"timestamp": [68.32, 68.74], "text": " Well, I'm Mr. Blue Guy."}, {"timestamp": [75.04, 75.2], "text": " I come from the Second Life and Open Simulator world."}, {"timestamp": [77.6, 77.72], "text": " I was an Open Simulator core developer for a while,"}, {"timestamp": [81.06, 81.6], "text": " so I've been doing virtual worlds for decades now."}, {"timestamp": [87.04, 87.48], "text": " And I'm interested in the standards and interfaces you guys are building."}, {"timestamp": [94.32, 97.1], "text": " I'm an infrastructure guy and worry about all the infrastructure for virtual worlds."}, {"timestamp": [105.06, 107.0], "text": " Great. Welcome. Great to have you here. Do you want to expand a bit more on what you mean with infrastructure? Just some keywords or phrases."}, {"timestamp": [116.04, 117.56], "text": " Well, like I said, API, the distribution of the computing, the different services, you know, people throw around metaverse as a service."}, {"timestamp": [127.26, 130.62], "text": " So I'm interested in the underlying infrastructure of how all the processes run and how you get user and world interaction happening."}, {"timestamp": [130.62, 133.38], "text": " Fantastic. Well, we're very happy to have you here."}, {"timestamp": [133.38, 140.44], "text": " Do any members want to reintroduce themselves, share any interesting"}, {"timestamp": [140.44, 144.08], "text": " things that happened in the last week today?"}, {"timestamp": [142.16, 148.32], "text": " interesting things that happened in the last week today."}, {"timestamp": [181.16, 181.58], "text": " Say a quick hello to Mr. Blue Guy. It's good to see you. We've crossed paths a few times on projects. All right, okay, let's share some fun finds that happened in the past week."}, {"timestamp": [184.6, 185.52], "text": " Jin shared two, and then Matikulak shared the Open Hardware Summit."}, {"timestamp": [187.44, 189.68], "text": " Jin do you want to talk us through Substratus?"}, {"timestamp": [192.0, 194.0], "text": " Or do you want to save it for a demo for a little bit later?"}, {"timestamp": [200.0, 201.12], "text": " I just want to give them a shout out. It's a fully open source web and native client."}, {"timestamp": [209.04, 213.22], "text": " You can even self-host the server. It's not really using a framework like 3GS or anything the web client is WebAssembly"}, {"timestamp": [213.22, 214.36], "text": " WebGL"}, {"timestamp": [214.36, 216.6], "text": " it's very performant"}, {"timestamp": [216.6, 218.86], "text": " and I'll leave the link for the web client"}, {"timestamp": [218.86, 221.72], "text": " if you wanted to check it out in your browser"}, {"timestamp": [221.72, 230.8], "text": " and it's just led by one dev currently but um"}, {"timestamp": [230.8, 238.7], "text": " very skilled and just a really cool project it's got an editor uh it's um"}, {"timestamp": [238.7, 245.74], "text": " got a community of people building parcels,"}, {"timestamp": [245.74, 252.32], "text": " and kind of like an experimental homebrew metaverse deck."}, {"timestamp": [255.92, 257.84], "text": " Yeah, this is pretty cool."}], "text": " Okay, welcome everyone. This is meeting 158. Let me share my screen. Mr. Medibose can't make it today because he is on some fancy networking thing or something. I saw it on Twitter. And Jimmy is here, but only I think in spirit because he's off traveling. So I did make notes of the things that was busy. Hi, I'm Beldum. That's what someone asked me. Alright, so welcome to meeting 158 of the Open Metaverse Interoperability Group. We're a bunch of indies and grassroots people and just people passionate about building the metaverse in whichever ways we are comfortable with. If you're new here and you would like to introduce yourself, you can do it now on voice or on text. Anyway, you feel comfortable. Well, I'm Mr. Blue Guy. I come from the Second Life and Open Simulator world. I was an Open Simulator core developer for a while, so I've been doing virtual worlds for decades now. And I'm interested in the standards and interfaces you guys are building. I'm an infrastructure guy and worry about all the infrastructure for virtual worlds. Great. Welcome. Great to have you here. Do you want to expand a bit more on what you mean with infrastructure? Just some keywords or phrases. Well, like I said, API, the distribution of the computing, the different services, you know, people throw around metaverse as a service. So I'm interested in the underlying infrastructure of how all the processes run and how you get user and world interaction happening. Fantastic. Well, we're very happy to have you here. Do any members want to reintroduce themselves, share any interesting things that happened in the last week today? interesting things that happened in the last week today. Say a quick hello to Mr. Blue Guy. It's good to see you. We've crossed paths a few times on projects. All right, okay, let's share some fun finds that happened in the past week. Jin shared two, and then Matikulak shared the Open Hardware Summit. Jin do you want to talk us through Substratus? Or do you want to save it for a demo for a little bit later? I just want to give them a shout out. It's a fully open source web and native client. You can even self-host the server. It's not really using a framework like 3GS or anything the web client is WebAssembly WebGL it's very performant and I'll leave the link for the web client if you wanted to check it out in your browser and it's just led by one dev currently but um very skilled and just a really cool project it's got an editor uh it's um got a community of people building parcels, and kind of like an experimental homebrew metaverse deck. Yeah, this is pretty cool."}