{"speakers": [], "chunks": [{"timestamp": [0.0, 8.22], "text": " chat with keyframe which is also not here um but that sounds great let's um do you want to"}, {"timestamp": [8.22, 11.14], "text": " do your demo now do you want to wait a couple of minutes see if more people join"}, {"timestamp": [11.14, 18.02], "text": " yeah sure we can start off with that uh let me share my screen then"}, {"timestamp": [18.02, 25.9], "text": " oh gotta go back to you justI, we are recording now."}, {"timestamp": [26.26, 32.1], "text": " Excellent."}, {"timestamp": [32.74, 35.92], "text": " Green."}, {"timestamp": [36.56, 37.74], "text": " Cool."}, {"timestamp": [38.78, 38.92], "text": " Looks good."}, {"timestamp": [39.3, 43.3], "text": " All right. So I'll just kind of zoom in on this a little bit."}, {"timestamp": [44.3, 47.96], "text": " Also, just to interrupt you, I can try and record on OBS,"}, {"timestamp": [48.14, 49.6], "text": " but I don't think I know what I'm doing."}, {"timestamp": [49.8, 51.96], "text": " Can someone else volunteer and record,"}, {"timestamp": [52.08, 54.14], "text": " and we can try and get this on the YouTube channel as well?"}, {"timestamp": [54.44, 55.58], "text": " Is that okay with you, Shota?"}, {"timestamp": [56.44, 57.34], "text": " Yeah, absolutely."}, {"timestamp": [58.02, 59.76], "text": " Okay, who can volunteer to record?"}, {"timestamp": [69.8, 70.06], "text": " I can do that, I guess, in another tab here, too."}, {"timestamp": [70.96, 76.26], "text": " Let me open OBS."}, {"timestamp": [78.7, 78.78], "text": " Though, like I said, I'm only going to be here for half the meeting."}, {"timestamp": [80.6, 83.4], "text": " I've got to drop, so I don't know if... Maybe somebody who's going to be here the whole time wants to do it instead."}, {"timestamp": [86.44, 86.9], "text": " It's just for your demo"}, {"timestamp": [86.9, 89.96], "text": " I want to get snippets into the YouTube channel"}, {"timestamp": [89.96, 92.32], "text": " so that will work well"}, {"timestamp": [92.32, 93.72], "text": " if you're willing to do both of those"}, {"timestamp": [93.72, 94.96], "text": " yeah absolutely"}, {"timestamp": [94.96, 98.08], "text": " and then just introduce yourself and what you're doing"}, {"timestamp": [98.08, 99.32], "text": " before you start demoing"}, {"timestamp": [99.32, 100.66], "text": " for sure"}, {"timestamp": [100.66, 103.6], "text": " okay hold on"}, {"timestamp": [103.6, 106.66], "text": " let me just set up my OBS here real quick."}, {"timestamp": [110.42, 112.92], "text": " Well, I'll introduce myself while I'm doing this."}, {"timestamp": [113.06, 113.52], "text": " Hey, everyone."}, {"timestamp": [113.86, 115.58], "text": " I am Solo Sobsist."}, {"timestamp": [116.06, 121.34], "text": " I am currently working on a project to create digital human twins"}, {"timestamp": [121.34, 125.48], "text": " with the purpose of helping people preserve their memories"}, {"timestamp": [125.48, 126.94], "text": " and their legacies."}, {"timestamp": [128.06, 133.92], "text": " So the way that we're kind of doing that is it's going to show up as primarily"}, {"timestamp": [133.92, 138.38], "text": " a web app, but will be available across all your devices."}, {"timestamp": [140.22, 152.9], "text": " Yeah, we're going to be able to create basically an interview procedure with you to collect a lot of that information, as well as augmenting it with, oh, I got to start recording."}, {"timestamp": [153.78, 154.9], "text": " Boop. There we go."}, {"timestamp": [155.08, 160.04], "text": " As well as augmenting it with information from your documents, your social media, stuff like that."}, {"timestamp": [169.42, 175.02], "text": " so yeah this kind of feeds right into some of the stuff that we needed from our document processing here at OMI so there's a bunch of meetings and things that have been recorded Jin's done a good"}, {"timestamp": [175.02, 180.96], "text": " job of using AI to summarize a bunch of this stuff but it kind of ends up just in a big bucket"}, {"timestamp": [180.96, 186.26], "text": " and is a little bit hard to interact with. And so luckily, there's a lot of"}, {"timestamp": [186.26, 194.36], "text": " crossover between document summarization for useful purposes, I guess, or productive purposes,"}, {"timestamp": [194.66, 200.8], "text": " and just for chatting just for fun. So yeah, I did some experimentation around that this week."}, {"timestamp": [201.26, 205.18], "text": " And so yeah, here's what we're going to take a look at. So basically, I just"}, {"timestamp": [205.18, 212.8], "text": " started with a very simple console app here. I'm using Semantic Kernel and Kernel Memory,"}, {"timestamp": [212.8, 219.26], "text": " two projects from Microsoft, to process this stuff. So if I scroll up a little bit, you can"}, {"timestamp": [219.26, 226.62], "text": " kind of see all the output from where it was processing these files. So for this test, I'm only using the meeting notes"}, {"timestamp": [226.62, 229.9], "text": " from the interop avatar characters meetings."}, {"timestamp": [230.68, 233.08], "text": " But those are getting parsed"}, {"timestamp": [233.08, 234.94], "text": " and it's creating a bunch of embeddings,"}, {"timestamp": [235.16, 239.14], "text": " which is then stored in a quadrant vector database."}, {"timestamp": [241.16, 244.8], "text": " Then, yeah, so now here I typed a prompt"}, {"timestamp": [244.8, 248.24], "text": " just as a test right before I started this meeting,"}, {"timestamp": [248.24, 252.34], "text": " which is just tell me about what's been going on with interoperable characters."}, {"timestamp": [252.68, 257.68], "text": " And it takes a little bit of time and then it's going to go through those documents"}, {"timestamp": [257.68, 265.28], "text": " and create that little summary for me. So let's, let's do a couple live."}, {"timestamp": [267.52, 268.22], "text": " We can ask it something like,"}, {"timestamp": [276.2, 276.74], "text": " what use cases are covered in this forum?"}, {"timestamp": [278.28, 278.4], "text": " Let's see what it'll come up with."}, {"timestamp": [278.72, 278.78], "text": " I don't know."}, {"timestamp": [279.84, 283.3], "text": " This is one I haven't tried yet."}, {"timestamp": [287.88, 292.16], "text": " So now it's doing the looking through and generating. So we go what's it what's it going to tell us um so it covers a wide variety of use cases related to avatars characters and"}, {"timestamp": [292.16, 297.92], "text": " their interoperability um so yeah awesome it did come up with a bunch of the use cases that we had"}, {"timestamp": [297.92, 308.08], "text": " been discussing so digital chatbots virtual singers np, stage production, blah, blah, blah. Yeah, so it takes a couple seconds"}, {"timestamp": [308.08, 315.7], "text": " to parse with that number of documents. So again, super early work. I'm sure there's lots of"}, {"timestamp": [315.7, 323.28], "text": " performance optimizations to be made around this stuff. And again, right now, just as a console"}, {"timestamp": [323.28, 326.2], "text": " app, but the next step for me is to incorporate"}, {"timestamp": [326.2, 331.44], "text": " this into the project that I'm working on, um, which would then make it accessible through"}, {"timestamp": [331.44, 336.76], "text": " a web interface, uh, to hopefully be usable by more folks."}, {"timestamp": [337.36, 339.26], "text": " Um, but yeah, that's basically it."}, {"timestamp": [339.26, 342.28], "text": " Um, any questions about what's going on?"}, {"timestamp": [346.48, 347.48], "text": " That's really cool."}, {"timestamp": [347.56, 350.06], "text": " And I like how it integrates what other members are also doing."}, {"timestamp": [350.4, 351.08], "text": " Really collaborative."}, {"timestamp": [356.52, 357.02], "text": " Cool."}, {"timestamp": [357.24, 362.98], "text": " Anybody have a question they want to ask to the avatar interoperability"}, {"timestamp": [362.98, 373.4], "text": " meetings? the avatar interoperability meetings."}, {"timestamp": [375.06, 375.62], "text": " Gary's typing something into the chat."}, {"timestamp": [377.1, 383.28], "text": " Yeah, I was going to see if you had a suggestion."}, {"timestamp": [385.28, 385.92], "text": " Most of us are not familiar with digital twins."}, {"timestamp": [386.62, 392.88], "text": " Yeah, definitely. And so I think the idea is to make it approachable and easy to use."}, {"timestamp": [393.4, 397.8], "text": " So I don't want people to necessarily have to be familiar with digital twins."}, {"timestamp": [398.56, 414.56], "text": " More just that they either want to have a virtual human in the likeness of themselves or someone else, or be able to access some kind of body of knowledge like this."}, {"timestamp": [415.58, 427.52], "text": " So the, you know, I use the term digital twins just because it's what I'm familiar using, but that's not, I think, a term that I expect most people to be familiar with"}, {"timestamp": [428.12, 436.46], "text": " yeah cool thanks guys I will keep updating you as this progresses"}, {"timestamp": [439.76, 446.48], "text": " awesome thank you very much that's really. We'll see if we can get that onto the YouTube."}, {"timestamp": [447.96, 451.6], "text": " On that, if people want to help look through..."}, {"timestamp": [451.6, 454.76], "text": " So if you could share that with just a Google Drive link"}, {"timestamp": [454.76, 456.68], "text": " or share the source in the media channel,"}, {"timestamp": [457.5, 461.84], "text": " then we can just give it a quick test run before we put it on YouTube."}, {"timestamp": [462.08, 466.0], "text": " And if people can volunteer to just look at things to see if"}, {"timestamp": [466.0, 467.34], "text": " everything's fine, there's not"}, {"timestamp": [467.34, 472.04], "text": " blank spaces or some sort of"}, {"timestamp": [472.04, 474.04], "text": " glitch, then that'll be"}, {"timestamp": [474.04, 476.28], "text": " appreciated. So that's cool."}, {"timestamp": [476.92, 477.34], "text": " Cool, great."}, {"timestamp": [479.52, 480.04], "text": " Right."}, {"timestamp": [480.72, 481.18], "text": " What's"}, {"timestamp": [481.18, 484.08], "text": " everybody been up to? Do we want"}, {"timestamp": [484.08, 488.3], "text": " to do working group updates"}, {"timestamp": [488.3, 492.94], "text": " what's happening out in the world feels like feels like things are busy and and"}, {"timestamp": [492.94, 521.1], "text": " there's only seven of us in the past week, Jimmy reached out"}, {"timestamp": [521.1, 525.68], "text": " to Wagner James, and I did see a reply on Twitter but I didn't want to"}, {"timestamp": [526.32, 530.88], "text": " mess with it and then mess up Jimmy's workflow but he did respond so that's pretty cool."}, {"timestamp": [531.92, 536.32], "text": " I think he wanted to ask Keyframe to also ping him but seeing that he's responded already that's"}, {"timestamp": [536.32, 545.42], "text": " probably less of an issue now. And something to do is make a sort of a canned agenda or semi-structured guiding questions and answers."}, {"timestamp": [546.62, 555.1], "text": " So that we don't have awkward silences or so that we more specifically don't have this just one person talking about irrelevant stuff."}, {"timestamp": [555.6, 559.92], "text": " Or, not irrelevant, but, you know, boring stuff."}, {"timestamp": [561.2, 563.58], "text": " Oh my goodness, a triple-digit heatwave here."}, {"timestamp": [564.12, 565.42], "text": " The heatwave broke here"}, {"timestamp": [565.42, 566.64], "text": " and it's been such a relief"}, {"timestamp": [566.64, 569.58], "text": " and now we're waiting for the hurricane season"}, {"timestamp": [569.58, 570.04], "text": " to start"}, {"timestamp": [570.04, 573.74], "text": " but so if there's questions that people would want"}, {"timestamp": [573.74, 575.7], "text": " to have asked in any"}, {"timestamp": [575.7, 576.58], "text": " sort of conversation"}, {"timestamp": [576.58, 579.58], "text": " that we have, then please"}, {"timestamp": [579.58, 580.24], "text": " suggest that"}, {"timestamp": [580.24, 583.42], "text": " you know, stuff like that sort of ties"}, {"timestamp": [583.42, 585.72], "text": " different conversations together and i suppose it's along"}, {"timestamp": [585.72, 592.04], "text": " the lines of what do you consider the metaverse being or what do you see your role in the metaverse"}, {"timestamp": [592.04, 596.6], "text": " but then also maybe more meatier questions or you know things that really start conversation"}, {"timestamp": [596.6, 606.64], "text": " so if you have suggestions on that please let us have them um jen contributed i don't know if it's useful if i share my screen"}, {"timestamp": [606.64, 613.68], "text": " um the link is in the chat jen said that this website poly polygonal mind is down"}, {"timestamp": [614.48, 621.2], "text": " and he's trying to archive it um so jimmy helped out but then saw that the the owner of the website"}, {"timestamp": [621.2, 626.42], "text": " is actually in m3 so i'm hoping jen Jin chats to him and see if we can archive that."}, {"timestamp": [626.42, 637.68], "text": " Maybe we can contribute that with a library project that is either part of Virtual Worlds or just a neglected thread in our experiments channel."}, {"timestamp": [639.28, 645.24], "text": " And then Jimmy also linked to Atlas Gnomic, because he was updating us yesterday in the media"}, {"timestamp": [645.24, 651.52], "text": " meeting that he was busy with knowledge graph research but was now more moving"}, {"timestamp": [651.52, 657.74], "text": " towards topic modeling and so now he's looking at Atlas Gnomic and that just"}, {"timestamp": [657.74, 707.24], "text": " sounded really interesting. So I can share the link in the channel. So I don't know if you have any input or comments on either Polygonal Mind or Atlas Gnomic or anything like that. I'm seeing Gary's typing something."}, {"timestamp": [707.9, 711.08], "text": " And then last week, after the meeting in the lounge,"}, {"timestamp": [711.5, 714.42], "text": " Humble Tim and iFire and myself were having, and Jimmy,"}, {"timestamp": [714.6, 718.32], "text": " were having a nice chat about the sort of Metaverse Festival idea."}, {"timestamp": [721.78, 727.74], "text": " And we wondered about if this idea of a single event is good because it's actually quite"}, {"timestamp": [727.74, 732.84], "text": " intimidating and then we wondered about the wisdom of just having a presence in something for the"}, {"timestamp": [732.84, 738.78], "text": " sake of having presence and so humbleton said something like maybe a type of ongoing behind"}, {"timestamp": [738.78, 746.72], "text": " the scenes documentary of how to build not a festival but a festival, but a metaverse, well, a metaverse festival type of vibe would"}, {"timestamp": [746.72, 753.44], "text": " be good, because it's something that's sort of an action term of doing an event or an"}, {"timestamp": [753.44, 760.28], "text": " initiative, rather than just inviting people to participate, or just witness something"}, {"timestamp": [760.28, 766.34], "text": " that is happening, you know, so it's not as well like having a behind the scenes"}, {"timestamp": [766.34, 770.86], "text": " sort of thing is much more welcoming than just saying well come look at this thing that i've"}, {"timestamp": [770.86, 776.5], "text": " built um and i really like that idea and i wanted to bounce it off you guys what do you think about"}, {"timestamp": [776.5, 783.04], "text": " that um because i think that gives a lot more agency to the stuff that we're already doing and"}, {"timestamp": [783.04, 785.3], "text": " you know we can chat about how we are"}, {"timestamp": [785.3, 790.82], "text": " contributing to that rather than just delivering the final product and hoping it makes it on time"}, {"timestamp": [790.82, 797.58], "text": " sort of thing um so yeah i appreciate your thoughts on it and then what gary says about"}, {"timestamp": [797.58, 802.12], "text": " the atlas nomic it sounds like that's implementing the big data into the metaverse and yeah i think"}, {"timestamp": [802.12, 809.68], "text": " that's that's sort of the idea that i got was it's another way of well like the website says structuring unstructured data and so"}, {"timestamp": [809.68, 814.48], "text": " that was really interesting jimmy did say that he couldn't make um most of the meeting and i'm"}, {"timestamp": [814.48, 818.96], "text": " guessing that turned into all of the meeting today um so he did out of a conflicting schedule"}, {"timestamp": [819.52, 874.88], "text": " but i'd love to hear more of what he's doing it sounded really interesting so um indy i guess it sounds like the that was kind of a question is like, what do we feel like about kind of building with that behind the scenes idea in mind?"}, {"timestamp": [882.32, 884.7], "text": " Because I think that sounds cool."}, {"timestamp": [884.7, 888.2], "text": " I am definitely all about the kind of behind the scenes"}, {"timestamp": [888.2, 896.44], "text": " type of content um i wonder is that something that like then the the media team"}, {"timestamp": [896.44, 904.78], "text": " is is on the hook to to create or is it kind of an ask like build our own content"}, {"timestamp": [904.78, 907.62], "text": " uh to share through those channels"}, {"timestamp": [907.62, 916.16], "text": " how do you kind of imagine that so it's up to all of us but the way that i'm seeing it is sort of"}, {"timestamp": [916.16, 920.92], "text": " working on what we're all doing already you know so so the demo that you just did and then we"}, {"timestamp": [920.92, 928.88], "text": " recorded and then hopefully get onto the youtube channel is part of that it's like hey this is what we're all doing to build the metaverse together and it's all our"}, {"timestamp": [928.88, 934.9], "text": " little bits and pieces and then it could also be you know we have this presence in this world and"}, {"timestamp": [934.9, 938.48], "text": " that world and whatever worlds that we choose because remember last week we were talking about"}, {"timestamp": [938.48, 942.4], "text": " why do we have to pick one world and then that world needs a blockchain wallet and then that"}, {"timestamp": [942.4, 948.92], "text": " isolates people so it's just you know you're doing something and then instead of it being well it's this one thing that's going"}, {"timestamp": [948.92, 954.16], "text": " to happen in almost in secret you know like not publicized and then there's this big launch date"}, {"timestamp": [954.16, 960.26], "text": " but now rather doing it whatever we do invite people and saying hey you know we're busy building"}, {"timestamp": [960.26, 969.32], "text": " this thing here um and this is how we're doing it and this is where we're getting stuck and this is what we've got to show this week so so it's a combination of the things that we're"}, {"timestamp": [969.32, 974.86], "text": " doing right now where everybody's building our own little things and then maybe doing getting"}, {"timestamp": [974.86, 980.28], "text": " like we're doing with the demos getting a little bit better at publicizing how we're building that"}, {"timestamp": [980.28, 986.44], "text": " and how we're progressing with this maybe extra layer added on to um sort of having"}, {"timestamp": [986.44, 992.52], "text": " meetups in a virtual world where we're building stuff and we're building it with a gltf spec and"}, {"timestamp": [992.52, 997.88], "text": " we're you know building assets that can be loaded onto sketch draw whatever for other people to use"}, {"timestamp": [997.88, 1006.0], "text": " um and then this you know the slowly maybe there's this campsite or you know, burner festival emerging, but"}, {"timestamp": [1006.0, 1007.98], "text": " it's something that stays"}, {"timestamp": [1007.98, 1009.74], "text": " there and that people can jump in and out of it."}, {"timestamp": [1009.8, 1011.82], "text": " It's not linked to a date or a specific event."}, {"timestamp": [1019.22, 1020.06], "text": " Yeah, I mean"}, {"timestamp": [1020.06, 1021.96], "text": " that sounds cool."}, {"timestamp": [1022.1, 1024.0], "text": " I think it's just like if we have"}, {"timestamp": [1024.0, 1030.04], "text": " a concrete way to kind of highlight"}, {"timestamp": [1030.04, 1035.0], "text": " that type of content um perhaps that'd be that'd be cool if there was like"}, {"timestamp": [1035.0, 1043.72], "text": " yeah a way to to share some of those work in progress things um in a kind of low touch"}, {"timestamp": [1043.72, 1046.92], "text": " way because i think you know if we wanted to do a like"}, {"timestamp": [1046.92, 1053.24], "text": " slickly produced behind the scenes thing that is definitely a barrier to entry to getting it done"}, {"timestamp": [1053.24, 1061.58], "text": " um you know and in the in the spirit of bias for action and the kind of raw nature of looking"}, {"timestamp": [1061.58, 1065.18], "text": " behind the scenes like if there's just yeah channel that we can kind of post"}, {"timestamp": [1065.18, 1073.04], "text": " like hey here's the stuff that's we're working on right now and um then maybe have some aggregation"}, {"timestamp": [1073.04, 1081.98], "text": " happen um on top of of that channel yeah absolutely and linking to what um gary's asking if we can"}, {"timestamp": [1081.98, 1085.92], "text": " port the demos to other platforms as well. All of this sort of depends"}, {"timestamp": [1085.92, 1087.72], "text": " on the people power that we have,"}, {"timestamp": [1088.04, 1089.78], "text": " which is not a lot. And so"}, {"timestamp": [1089.78, 1091.9], "text": " having a strategy that works with"}, {"timestamp": [1091.9, 1093.86], "text": " what we have and"}, {"timestamp": [1093.86, 1095.98], "text": " sort of keeps to that grassroots"}, {"timestamp": [1095.98, 1097.9], "text": " we do things as we get"}, {"timestamp": [1097.9, 1099.86], "text": " to them thing, but maybe with a little bit more strategy"}, {"timestamp": [1099.86, 1101.84], "text": " and direction. So I was"}, {"timestamp": [1101.84, 1103.78], "text": " thinking if someone jumps in and they're new"}, {"timestamp": [1103.78, 1105.04], "text": " here and they just want to help"}, {"timestamp": [1105.04, 1110.98], "text": " then having things it's like hey this is where this lives can you do that with this um in a very"}, {"timestamp": [1110.98, 1116.2], "text": " in a more sort of specific these are the step-by-step things that you can help with um"}, {"timestamp": [1116.2, 1122.52], "text": " would be good um yeah because i agree with you slick is hard you know it's it's"}, {"timestamp": [1122.52, 1126.24], "text": " it's exponentially harder than just sort of sharing"}, {"timestamp": [1126.24, 1133.92], "text": " what you're doing on the go um hey jen how you doing we're busy talking about the sort of metaverse"}, {"timestamp": [1133.92, 1139.84], "text": " festival and rather than having that as a single event or a slickly produced sort of"}, {"timestamp": [1140.46, 1146.2], "text": " half conference sort of thing more having an organic growth thing that sort of"}, {"timestamp": [1146.2, 1148.56], "text": " feels more like a behind the scenes documentary"}, {"timestamp": [1148.56, 1150.48], "text": " documenting"}, {"timestamp": [1150.48, 1152.48], "text": " as we go sort of thing"}, {"timestamp": [1152.48, 1154.48], "text": " so I was wondering if you've got thoughts on that"}, {"timestamp": [1155.52, 1158.24], "text": " I'm bearing"}, {"timestamp": [1158.24, 1158.92], "text": " my guard"}, {"timestamp": [1158.92, 1160.56], "text": " documentaries"}, {"timestamp": [1160.56, 1163.88], "text": " are good I like them"}, {"timestamp": [1163.88, 1166.2], "text": " you know just ways of kind of Documentaries are good. I like them."}, {"timestamp": [1175.16, 1175.48], "text": " You know, just ways of kind of condensing the body of work into something that is consumable, easy to digest."}, {"timestamp": [1177.68, 1180.18], "text": " That's very helpful, useful stuff."}, {"timestamp": [1183.42, 1186.96], "text": " Yeah, and sort of linking up with the visual space of it. So it's all the things that we're doing with videoing the demos"}, {"timestamp": [1186.96, 1190.24], "text": " and your collection of the meetings"}, {"timestamp": [1190.24, 1193.06], "text": " and making them into SIGGRAPH-like posters."}, {"timestamp": [1193.54, 1198.58], "text": " All of that should live in a collection of virtual worlds."}, {"timestamp": [1199.14, 1201.02], "text": " And then that becomes the physical manifestation"}, {"timestamp": [1201.02, 1203.2], "text": " of this documentary or journey."}, {"timestamp": [1205.16, 1206.12], "text": " Rather than having a single output, whether that's a documentary or a documentary or journey, you know. Rather than having"}, {"timestamp": [1206.12, 1207.8], "text": " a single output, whether that's a documentary"}, {"timestamp": [1207.8, 1210.02], "text": " or a conference or event, you have this"}, {"timestamp": [1210.02, 1212.06], "text": " journey that you take people on, but that"}, {"timestamp": [1212.06, 1212.62], "text": " they can also"}, {"timestamp": [1212.62, 1215.94], "text": " live, you know,"}, {"timestamp": [1215.98, 1217.44], "text": " that they can also go and visit"}, {"timestamp": [1217.44, 1218.96], "text": " in a world."}, {"timestamp": [1220.46, 1222.0], "text": " So I'm trying to get away from the"}, {"timestamp": [1222.0, 1223.58], "text": " single event that gets launched,"}, {"timestamp": [1223.86, 1227.94], "text": " which is just intimidating, especially if you don't have enough people to make it."}, {"timestamp": [1227.94, 1230.82], "text": " It kind of sounds like an overworld, what you're describing."}, {"timestamp": [1232.62, 1234.06], "text": " A what? An overworld?"}, {"timestamp": [1234.9, 1245.88], "text": " Yeah, it's a video game kind of like a map where you can teleport to areas or, you know, like an interactive overworld."}, {"timestamp": [1248.68, 1250.5], "text": " Oh, that does sound very interesting."}, {"timestamp": [1252.24, 1252.8], "text": " Yeah."}, {"timestamp": [1256.46, 1258.8], "text": " I'm seeing also in a chat, like Atlas,"}, {"timestamp": [1259.1, 1261.18], "text": " like force graphs could be an overworld."}, {"timestamp": [1261.6, 1267.2], "text": " Like if you structure maybe by topics,"}, {"timestamp": [1267.2, 1273.38], "text": " you could use a 2D force graph as a way of navigating"}, {"timestamp": [1273.38, 1276.04], "text": " and zooming in."}, {"timestamp": [1276.04, 1278.28], "text": " It's like breadth-first search in a way."}, {"timestamp": [1282.82, 1286.32], "text": " Yeah, so it's sort of like a meta festival."}, {"timestamp": [1287.64, 1288.64], "text": " I see Sola has to drop."}, {"timestamp": [1288.7, 1289.36], "text": " Thank you very much."}, {"timestamp": [1289.96, 1292.16], "text": " And you can just post the link to the demo"}, {"timestamp": [1292.16, 1294.34], "text": " in the media and then we'll..."}, {"timestamp": [1294.34, 1296.4], "text": " Or, you know, we still have to ask"}, {"timestamp": [1296.4, 1298.32], "text": " about if someone has a YouTube"}, {"timestamp": [1298.32, 1300.42], "text": " channel, how do we share that in the playlist?"}, {"timestamp": [1302.14, 1303.26], "text": " Do that meta thing."}, {"timestamp": [1304.1, 1307.72], "text": " But yeah, that's cool. yeah so so in terms of the force"}, {"timestamp": [1307.72, 1312.74], "text": " graph yeah it's all of those things sort of together and layers of it you know so i think"}, {"timestamp": [1312.74, 1317.9], "text": " um a long time ago we spoke about the force graph as that could be like a starry constellation"}, {"timestamp": [1317.9, 1322.58], "text": " so if you imagine this overworld thing that has our assets and the things we're busy with"}, {"timestamp": [1322.58, 1329.44], "text": " maybe if you look up there's this constellation of stars and each star is a point or node of some piece of knowledge,"}, {"timestamp": [1330.34, 1397.02], "text": " you know, that then links to all the knowledge things. you you I'm Jen do you have any updates from emissive the updates about what's been happening in"}, {"timestamp": [1397.02, 1409.08], "text": " the past week Ben Irwin hit me up he wants to do something about digital fashion because he's talking on a panel next week."}, {"timestamp": [1410.1, 1413.2], "text": " But next week is Labor Day Monday."}, {"timestamp": [1413.8, 1422.4], "text": " So again, maybe you can do something digital fashion related outside the usual Monday schedule."}, {"timestamp": [1422.24, 1425.24], "text": " outside of the usual Monday schedule."}, {"timestamp": [1427.64, 1432.44], "text": " I'm not sure what that might be. I know Decentraland is doing something wearables related."}, {"timestamp": [1432.44, 1436.02], "text": " M3 is working on projects in this space."}, {"timestamp": [1441.08, 1445.18], "text": " Maybe we can spin something up over the weekend."}, {"timestamp": [1445.18, 1449.24], "text": " But in terms of MSF,"}, {"timestamp": [1449.56, 1455.18], "text": " that's pretty much it other than wanting to"}, {"timestamp": [1456.02, 1464.3], "text": " kind of do more of the graph rag and AI analysis of things"}, {"timestamp": [1464.3, 1466.34], "text": " to assist with overall"}, {"timestamp": [1466.34, 1468.36], "text": " big picture stuff there."}, {"timestamp": [1472.24, 1474.36], "text": " Yeah, just been really busy with the avatar"}, {"timestamp": [1474.36, 1475.4], "text": " projects, though."}, {"timestamp": [1481.02, 1482.5], "text": " Still sounds like progress."}, {"timestamp": [1483.16, 1484.54], "text": " What if, rather"}, {"timestamp": [1484.54, 1488.18], "text": " than spinning something up, one can curate the different things that is happening?"}, {"timestamp": [1488.54, 1495.32], "text": " Sort of lacework, building stuff from scratch, and just working on being a trumpet for the things that's already out there."}, {"timestamp": [1496.42, 1498.56], "text": " I'm a fan of that strategy."}, {"timestamp": [1499.92, 1506.14], "text": " If I see something happening, I'd rather just kind of attend that"}, {"timestamp": [1506.14, 1509.06], "text": " and they kind of take care of all the event logistics"}, {"timestamp": [1509.06, 1511.4], "text": " and be a participant."}, {"timestamp": [1511.4, 1516.3], "text": " And I also kind of like the golden principle in a way,"}, {"timestamp": [1518.16, 1519.32], "text": " leading by example."}, {"timestamp": [1520.1, 1525.1], "text": " I wish other communities would take such field trips."}, {"timestamp": [1525.1, 1531.34], "text": " So showing up as a group to other community events"}, {"timestamp": [1531.34, 1557.4], "text": " that are happening sends a message. I totally agree with that."}, {"timestamp": [1557.98, 1560.32], "text": " Then I had a question."}, {"timestamp": [1562.8, 1564.56], "text": " Oh, there's something that's happening."}, {"timestamp": [1565.46, 1569.64], "text": " Get the tea going on from 0 to 100 on Decentraland."}, {"timestamp": [1569.92, 1571.92], "text": " Happening in 30 minutes, so that sounds cool."}, {"timestamp": [1572.7, 1574.08], "text": " So let's try and wrap up here."}, {"timestamp": [1574.32, 1576.32], "text": " Sounds like there's not too much to discuss today."}, {"timestamp": [1576.6, 1579.28], "text": " But I had a question that I wanted to bounce off you guys."}, {"timestamp": [1579.28, 1580.9], "text": " Let me share my screen."}, {"timestamp": [1587.78, 1597.5], "text": " share my screen and i want to know about things that um is either welcoming or barrier to entry to people in online communities and so this"}, {"timestamp": [1597.5, 1606.86], "text": " is part of my um sort of sort of um postdoc thing because this is what i'm trying to study in different communities that"}, {"timestamp": [1606.86, 1613.64], "text": " in my mind sort of mushes together to become the metaverse um and so there's a social culture that"}, {"timestamp": [1613.64, 1618.6], "text": " um and this also comes from a conversation that i had with um in the lounge last week with humbleton"}, {"timestamp": [1618.6, 1625.58], "text": " and ifire where um i think humbleton entered into vr and iFire really showed him around and sort of"}, {"timestamp": [1625.58, 1630.76], "text": " sponsored him was the word he used that in this graph I say as active mentorship."}, {"timestamp": [1631.82, 1636.64], "text": " So on the sort of bad side of providing a barrier to entry you have this gatekeeping"}, {"timestamp": [1636.64, 1642.2], "text": " and I think hazing is something that Wiki used. In the middle you have a sort of a neutral moderation"}, {"timestamp": [1642.2, 1647.32], "text": " sort of you know we're not providing barriers to entry but you know that you have a sort of a neutral moderation um sort of you know we're not providing barriers"}, {"timestamp": [1647.32, 1651.6], "text": " to entry but you know that you're being sort of watched and not you know maintain that your"}, {"timestamp": [1651.6, 1657.68], "text": " behavior is appropriate and then to me on the far um on the positive side you have active"}, {"timestamp": [1657.68, 1661.3], "text": " mentorship where someone actually walks you through and and that could be that doesn't have"}, {"timestamp": [1661.3, 1665.1], "text": " to be a person it could be an ai agent. It could be well-designed tutorials."}, {"timestamp": [1665.38, 1667.22], "text": " So if you just start playing a game,"}, {"timestamp": [1668.06, 1671.54], "text": " sometimes you run through this tutorial that's fun,"}, {"timestamp": [1671.68, 1673.36], "text": " and it basically shows you how the game works."}, {"timestamp": [1674.36, 1676.58], "text": " And so I sort of saw that as the social culture."}, {"timestamp": [1676.58, 1681.84], "text": " But then I'm stuck with what does the technical design have here."}, {"timestamp": [1682.16, 1684.08], "text": " And with chatting with Kim,"}, {"timestamp": [1684.3, 1686.52], "text": " we were sort of thinking about maybe it's"}, {"timestamp": [1686.52, 1688.5], "text": " indie versus enterprise"}, {"timestamp": [1688.5, 1690.38], "text": " or corporate. It could be"}, {"timestamp": [1690.38, 1692.44], "text": " anonymous, that you're allowed"}, {"timestamp": [1692.44, 1694.7], "text": " anonymous or private participation"}, {"timestamp": [1694.7, 1696.68], "text": " versus that you have to go through a bunch"}, {"timestamp": [1696.68, 1697.66], "text": " of registration"}, {"timestamp": [1697.66, 1700.76], "text": " things. So I wanted to ask"}, {"timestamp": [1700.76, 1702.34], "text": " what do you think about this?"}, {"timestamp": [1702.6, 1704.66], "text": " Is this graph a decent"}, {"timestamp": [1704.66, 1709.1], "text": " base to categorize online communities"}, {"timestamp": [1709.1, 1712.78], "text": " and the ease of entry?"}, {"timestamp": [1712.78, 1715.5], "text": " And specifically, what would you put on the technical axis?"}, {"timestamp": [1719.26, 1721.38], "text": " Yeah, that's my question."}, {"timestamp": [1721.38, 1723.84], "text": " I'm going to screenshot this and post it in the link."}, {"timestamp": [1723.84, 1726.32], "text": " It's pretty much a work in progress."}, {"timestamp": [1726.32, 1730.56], "text": " I don't think it's the right kind of chart."}, {"timestamp": [1730.56, 1734.52], "text": " I think there's a better chart."}, {"timestamp": [1734.52, 1737.34], "text": " It might be the funnel."}, {"timestamp": [1741.66, 1743.06], "text": " I can pull up an example."}, {"timestamp": [1746.88, 1749.16], "text": " Yeah, so I guess the funnel would be..."}, {"timestamp": [1749.16, 1751.4], "text": " This could be looking at the funnel from the top,"}, {"timestamp": [1751.56, 1753.0], "text": " so you sort of..."}, {"timestamp": [1754.84, 1755.94], "text": " A cross-section."}, {"timestamp": [1756.64, 1757.28], "text": " That sounds good."}, {"timestamp": [1785.12, 1788.16], "text": " Yeah, let me just try and find… All right. Yeah. Like this is one funnel that I have."}, {"timestamp": [1794.36, 1800.32], "text": " It's from this article, but you know, there's barriers,"}, {"timestamp": [1800.58, 1801.82], "text": " there's levels to it."}, {"timestamp": [1801.9, 1802.32], "text": " You know what I mean?"}, {"timestamp": [1802.32, 1806.2], "text": " So it's not like maybe."}], "text": " chat with keyframe which is also not here um but that sounds great let's um do you want to do your demo now do you want to wait a couple of minutes see if more people join yeah sure we can start off with that uh let me share my screen then oh gotta go back to you justI, we are recording now. Excellent. Green. Cool. Looks good. All right. So I'll just kind of zoom in on this a little bit. Also, just to interrupt you, I can try and record on OBS, but I don't think I know what I'm doing. Can someone else volunteer and record, and we can try and get this on the YouTube channel as well? Is that okay with you, Shota? Yeah, absolutely. Okay, who can volunteer to record? I can do that, I guess, in another tab here, too. Let me open OBS. Though, like I said, I'm only going to be here for half the meeting. I've got to drop, so I don't know if... Maybe somebody who's going to be here the whole time wants to do it instead. It's just for your demo I want to get snippets into the YouTube channel so that will work well if you're willing to do both of those yeah absolutely and then just introduce yourself and what you're doing before you start demoing for sure okay hold on let me just set up my OBS here real quick. Well, I'll introduce myself while I'm doing this. Hey, everyone. I am Solo Sobsist. I am currently working on a project to create digital human twins with the purpose of helping people preserve their memories and their legacies. So the way that we're kind of doing that is it's going to show up as primarily a web app, but will be available across all your devices. Yeah, we're going to be able to create basically an interview procedure with you to collect a lot of that information, as well as augmenting it with, oh, I got to start recording. Boop. There we go. As well as augmenting it with information from your documents, your social media, stuff like that. so yeah this kind of feeds right into some of the stuff that we needed from our document processing here at OMI so there's a bunch of meetings and things that have been recorded Jin's done a good job of using AI to summarize a bunch of this stuff but it kind of ends up just in a big bucket and is a little bit hard to interact with. And so luckily, there's a lot of crossover between document summarization for useful purposes, I guess, or productive purposes, and just for chatting just for fun. So yeah, I did some experimentation around that this week. And so yeah, here's what we're going to take a look at. So basically, I just started with a very simple console app here. I'm using Semantic Kernel and Kernel Memory, two projects from Microsoft, to process this stuff. So if I scroll up a little bit, you can kind of see all the output from where it was processing these files. So for this test, I'm only using the meeting notes from the interop avatar characters meetings. But those are getting parsed and it's creating a bunch of embeddings, which is then stored in a quadrant vector database. Then, yeah, so now here I typed a prompt just as a test right before I started this meeting, which is just tell me about what's been going on with interoperable characters. And it takes a little bit of time and then it's going to go through those documents and create that little summary for me. So let's, let's do a couple live. We can ask it something like, what use cases are covered in this forum? Let's see what it'll come up with. I don't know. This is one I haven't tried yet. So now it's doing the looking through and generating. So we go what's it what's it going to tell us um so it covers a wide variety of use cases related to avatars characters and their interoperability um so yeah awesome it did come up with a bunch of the use cases that we had been discussing so digital chatbots virtual singers np, stage production, blah, blah, blah. Yeah, so it takes a couple seconds to parse with that number of documents. So again, super early work. I'm sure there's lots of performance optimizations to be made around this stuff. And again, right now, just as a console app, but the next step for me is to incorporate this into the project that I'm working on, um, which would then make it accessible through a web interface, uh, to hopefully be usable by more folks. Um, but yeah, that's basically it. Um, any questions about what's going on? That's really cool. And I like how it integrates what other members are also doing. Really collaborative. Cool. Anybody have a question they want to ask to the avatar interoperability meetings? the avatar interoperability meetings. Gary's typing something into the chat. Yeah, I was going to see if you had a suggestion. Most of us are not familiar with digital twins. Yeah, definitely. And so I think the idea is to make it approachable and easy to use. So I don't want people to necessarily have to be familiar with digital twins. More just that they either want to have a virtual human in the likeness of themselves or someone else, or be able to access some kind of body of knowledge like this. So the, you know, I use the term digital twins just because it's what I'm familiar using, but that's not, I think, a term that I expect most people to be familiar with yeah cool thanks guys I will keep updating you as this progresses awesome thank you very much that's really. We'll see if we can get that onto the YouTube. On that, if people want to help look through... So if you could share that with just a Google Drive link or share the source in the media channel, then we can just give it a quick test run before we put it on YouTube. And if people can volunteer to just look at things to see if everything's fine, there's not blank spaces or some sort of glitch, then that'll be appreciated. So that's cool. Cool, great. Right. What's everybody been up to? Do we want to do working group updates what's happening out in the world feels like feels like things are busy and and there's only seven of us in the past week, Jimmy reached out to Wagner James, and I did see a reply on Twitter but I didn't want to mess with it and then mess up Jimmy's workflow but he did respond so that's pretty cool. I think he wanted to ask Keyframe to also ping him but seeing that he's responded already that's probably less of an issue now. And something to do is make a sort of a canned agenda or semi-structured guiding questions and answers. So that we don't have awkward silences or so that we more specifically don't have this just one person talking about irrelevant stuff. Or, not irrelevant, but, you know, boring stuff. Oh my goodness, a triple-digit heatwave here. The heatwave broke here and it's been such a relief and now we're waiting for the hurricane season to start but so if there's questions that people would want to have asked in any sort of conversation that we have, then please suggest that you know, stuff like that sort of ties different conversations together and i suppose it's along the lines of what do you consider the metaverse being or what do you see your role in the metaverse but then also maybe more meatier questions or you know things that really start conversation so if you have suggestions on that please let us have them um jen contributed i don't know if it's useful if i share my screen um the link is in the chat jen said that this website poly polygonal mind is down and he's trying to archive it um so jimmy helped out but then saw that the the owner of the website is actually in m3 so i'm hoping jen Jin chats to him and see if we can archive that. Maybe we can contribute that with a library project that is either part of Virtual Worlds or just a neglected thread in our experiments channel. And then Jimmy also linked to Atlas Gnomic, because he was updating us yesterday in the media meeting that he was busy with knowledge graph research but was now more moving towards topic modeling and so now he's looking at Atlas Gnomic and that just sounded really interesting. So I can share the link in the channel. So I don't know if you have any input or comments on either Polygonal Mind or Atlas Gnomic or anything like that. I'm seeing Gary's typing something. And then last week, after the meeting in the lounge, Humble Tim and iFire and myself were having, and Jimmy, were having a nice chat about the sort of Metaverse Festival idea. And we wondered about if this idea of a single event is good because it's actually quite intimidating and then we wondered about the wisdom of just having a presence in something for the sake of having presence and so humbleton said something like maybe a type of ongoing behind the scenes documentary of how to build not a festival but a festival, but a metaverse, well, a metaverse festival type of vibe would be good, because it's something that's sort of an action term of doing an event or an initiative, rather than just inviting people to participate, or just witness something that is happening, you know, so it's not as well like having a behind the scenes sort of thing is much more welcoming than just saying well come look at this thing that i've built um and i really like that idea and i wanted to bounce it off you guys what do you think about that um because i think that gives a lot more agency to the stuff that we're already doing and you know we can chat about how we are contributing to that rather than just delivering the final product and hoping it makes it on time sort of thing um so yeah i appreciate your thoughts on it and then what gary says about the atlas nomic it sounds like that's implementing the big data into the metaverse and yeah i think that's that's sort of the idea that i got was it's another way of well like the website says structuring unstructured data and so that was really interesting jimmy did say that he couldn't make um most of the meeting and i'm guessing that turned into all of the meeting today um so he did out of a conflicting schedule but i'd love to hear more of what he's doing it sounded really interesting so um indy i guess it sounds like the that was kind of a question is like, what do we feel like about kind of building with that behind the scenes idea in mind? Because I think that sounds cool. I am definitely all about the kind of behind the scenes type of content um i wonder is that something that like then the the media team is is on the hook to to create or is it kind of an ask like build our own content uh to share through those channels how do you kind of imagine that so it's up to all of us but the way that i'm seeing it is sort of working on what we're all doing already you know so so the demo that you just did and then we recorded and then hopefully get onto the youtube channel is part of that it's like hey this is what we're all doing to build the metaverse together and it's all our little bits and pieces and then it could also be you know we have this presence in this world and that world and whatever worlds that we choose because remember last week we were talking about why do we have to pick one world and then that world needs a blockchain wallet and then that isolates people so it's just you know you're doing something and then instead of it being well it's this one thing that's going to happen in almost in secret you know like not publicized and then there's this big launch date but now rather doing it whatever we do invite people and saying hey you know we're busy building this thing here um and this is how we're doing it and this is where we're getting stuck and this is what we've got to show this week so so it's a combination of the things that we're doing right now where everybody's building our own little things and then maybe doing getting like we're doing with the demos getting a little bit better at publicizing how we're building that and how we're progressing with this maybe extra layer added on to um sort of having meetups in a virtual world where we're building stuff and we're building it with a gltf spec and we're you know building assets that can be loaded onto sketch draw whatever for other people to use um and then this you know the slowly maybe there's this campsite or you know, burner festival emerging, but it's something that stays there and that people can jump in and out of it. It's not linked to a date or a specific event. Yeah, I mean that sounds cool. I think it's just like if we have a concrete way to kind of highlight that type of content um perhaps that'd be that'd be cool if there was like yeah a way to to share some of those work in progress things um in a kind of low touch way because i think you know if we wanted to do a like slickly produced behind the scenes thing that is definitely a barrier to entry to getting it done um you know and in the in the spirit of bias for action and the kind of raw nature of looking behind the scenes like if there's just yeah channel that we can kind of post like hey here's the stuff that's we're working on right now and um then maybe have some aggregation happen um on top of of that channel yeah absolutely and linking to what um gary's asking if we can port the demos to other platforms as well. All of this sort of depends on the people power that we have, which is not a lot. And so having a strategy that works with what we have and sort of keeps to that grassroots we do things as we get to them thing, but maybe with a little bit more strategy and direction. So I was thinking if someone jumps in and they're new here and they just want to help then having things it's like hey this is where this lives can you do that with this um in a very in a more sort of specific these are the step-by-step things that you can help with um would be good um yeah because i agree with you slick is hard you know it's it's it's exponentially harder than just sort of sharing what you're doing on the go um hey jen how you doing we're busy talking about the sort of metaverse festival and rather than having that as a single event or a slickly produced sort of half conference sort of thing more having an organic growth thing that sort of feels more like a behind the scenes documentary documenting as we go sort of thing so I was wondering if you've got thoughts on that I'm bearing my guard documentaries are good I like them you know just ways of kind of Documentaries are good. I like them. You know, just ways of kind of condensing the body of work into something that is consumable, easy to digest. That's very helpful, useful stuff. Yeah, and sort of linking up with the visual space of it. So it's all the things that we're doing with videoing the demos and your collection of the meetings and making them into SIGGRAPH-like posters. All of that should live in a collection of virtual worlds. And then that becomes the physical manifestation of this documentary or journey. Rather than having a single output, whether that's a documentary or a documentary or journey, you know. Rather than having a single output, whether that's a documentary or a conference or event, you have this journey that you take people on, but that they can also live, you know, that they can also go and visit in a world. So I'm trying to get away from the single event that gets launched, which is just intimidating, especially if you don't have enough people to make it. It kind of sounds like an overworld, what you're describing. A what? An overworld? Yeah, it's a video game kind of like a map where you can teleport to areas or, you know, like an interactive overworld. Oh, that does sound very interesting. Yeah. I'm seeing also in a chat, like Atlas, like force graphs could be an overworld. Like if you structure maybe by topics, you could use a 2D force graph as a way of navigating and zooming in. It's like breadth-first search in a way. Yeah, so it's sort of like a meta festival. I see Sola has to drop. Thank you very much. And you can just post the link to the demo in the media and then we'll... Or, you know, we still have to ask about if someone has a YouTube channel, how do we share that in the playlist? Do that meta thing. But yeah, that's cool. yeah so so in terms of the force graph yeah it's all of those things sort of together and layers of it you know so i think um a long time ago we spoke about the force graph as that could be like a starry constellation so if you imagine this overworld thing that has our assets and the things we're busy with maybe if you look up there's this constellation of stars and each star is a point or node of some piece of knowledge, you know, that then links to all the knowledge things. you you I'm Jen do you have any updates from emissive the updates about what's been happening in the past week Ben Irwin hit me up he wants to do something about digital fashion because he's talking on a panel next week. But next week is Labor Day Monday. So again, maybe you can do something digital fashion related outside the usual Monday schedule. outside of the usual Monday schedule. I'm not sure what that might be. I know Decentraland is doing something wearables related. M3 is working on projects in this space. Maybe we can spin something up over the weekend. But in terms of MSF, that's pretty much it other than wanting to kind of do more of the graph rag and AI analysis of things to assist with overall big picture stuff there. Yeah, just been really busy with the avatar projects, though. Still sounds like progress. What if, rather than spinning something up, one can curate the different things that is happening? Sort of lacework, building stuff from scratch, and just working on being a trumpet for the things that's already out there. I'm a fan of that strategy. If I see something happening, I'd rather just kind of attend that and they kind of take care of all the event logistics and be a participant. And I also kind of like the golden principle in a way, leading by example. I wish other communities would take such field trips. So showing up as a group to other community events that are happening sends a message. I totally agree with that. Then I had a question. Oh, there's something that's happening. Get the tea going on from 0 to 100 on Decentraland. Happening in 30 minutes, so that sounds cool. So let's try and wrap up here. Sounds like there's not too much to discuss today. But I had a question that I wanted to bounce off you guys. Let me share my screen. share my screen and i want to know about things that um is either welcoming or barrier to entry to people in online communities and so this is part of my um sort of sort of um postdoc thing because this is what i'm trying to study in different communities that in my mind sort of mushes together to become the metaverse um and so there's a social culture that um and this also comes from a conversation that i had with um in the lounge last week with humbleton and ifire where um i think humbleton entered into vr and iFire really showed him around and sort of sponsored him was the word he used that in this graph I say as active mentorship. So on the sort of bad side of providing a barrier to entry you have this gatekeeping and I think hazing is something that Wiki used. In the middle you have a sort of a neutral moderation sort of you know we're not providing barriers to entry but you know that you have a sort of a neutral moderation um sort of you know we're not providing barriers to entry but you know that you're being sort of watched and not you know maintain that your behavior is appropriate and then to me on the far um on the positive side you have active mentorship where someone actually walks you through and and that could be that doesn't have to be a person it could be an ai agent. It could be well-designed tutorials. So if you just start playing a game, sometimes you run through this tutorial that's fun, and it basically shows you how the game works. And so I sort of saw that as the social culture. But then I'm stuck with what does the technical design have here. And with chatting with Kim, we were sort of thinking about maybe it's indie versus enterprise or corporate. It could be anonymous, that you're allowed anonymous or private participation versus that you have to go through a bunch of registration things. So I wanted to ask what do you think about this? Is this graph a decent base to categorize online communities and the ease of entry? And specifically, what would you put on the technical axis? Yeah, that's my question. I'm going to screenshot this and post it in the link. It's pretty much a work in progress. I don't think it's the right kind of chart. I think there's a better chart. It might be the funnel. I can pull up an example. Yeah, so I guess the funnel would be... This could be looking at the funnel from the top, so you sort of... A cross-section. That sounds good. Yeah, let me just try and find… All right. Yeah. Like this is one funnel that I have. It's from this article, but you know, there's barriers, there's levels to it. You know what I mean? So it's not like maybe."}