{"data":{"repository":{"discussions":{"totalCount":160,"nodes":[{"id":"D_kwDOFUbqUM4ATez6","category":{"name":"General"},"upvoteCount":1,"updatedAt":"2023-04-20T01:25:15Z","createdAt":"2023-04-19T17:57:11Z","number":385,"title":"04/19/23 Weekly Meeting 104 Notes/Agenda","body":"Weekly Meeting 104 is happening on Wednesday, April 19, 2023 from 9:00 AM PST (16:00 UTC) - 10:00 AM PST (17:00 UTC)\r\n\r\nYou can add it to your calendar [here](https://calendar.google.com/calendar/u/1?cid=Y18wZHB1Z2Y5ZjgzZXE0cWVrbWI2b21xYmptZ0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t).\r\n \r\nWe'll be meeting again in the omi-weekly-meeting channel of the [AngellXR/OMI Discord](https://discord.gg/NJtT9grz5E).\r\nWe regularly use the # omi-meeting-chat channel for text chat. \r\n\r\n## Who we are and why we're here:\r\n\r\nThe Open Metaverse Interoperability Group (OMI) is focused on bridging virtual worlds by designing and promoting protocols for identity, social graphs, inventory, and more. Our members include businesses and individuals working towards this common goal. \r\n\r\nIf you’re an observer or here for the first time, this is a meeting where people who work on the OMI group initiatives discuss updates and contribution opportunities for current projects and goals. This is your chance to jump in and help!\r\n\r\nWe welcome you to introduce yourself in #omi-meeting-chat as we dive into the agenda items. There will be an open floor in the last 15 minutes of the meeting (agenda permitting) where we can discuss any items you feel are relevant to the current or near future OMI goals.\r\n\r\n## Agenda\r\n\r\nUPDATES:\r\n\r\nMSF-delegates:\r\n- MSF just publicly announced their incorporation into a nonprofit industry consortium (announced April 18, 2023)\r\nhttps://twitter.com/Metaverse_Forum/status/1648312697161932800\r\n\r\n- There is a board election coming up - it's important that we/OMI have a representative on the MSF board, so we can continue to be a voice for independent creators, small orgs, open source and community/grassroots orgs. Elections will be in a few weeks but we can start preparing our community for that now. (There are some documents we will need to fill out).\r\n\r\n- Interoperability issue to bring to the attention of MSF and industry in general (via @aaronfranke):\r\n-- There are competing standards between OMI's [OMI_collider](https://github.com/omigroup/gltf-extensions/tree/main/extensions/2.0/OMI_collider) and [OMI_physics_body](https://github.com/omigroup/gltf-extensions/tree/main/extensions/2.0/OMI_physics_body) glTF extensions and Microsoft's physics https://github.com/KhronosGroup/glTF/pull/2257.\r\n\r\n-- Issue is described in detail in this [OMI_collider and OMI_physics_body pull request](https://github.com/KhronosGroup/glTF/pull/2258) and there's a bulleted list of specific differences and impacts. \r\n\r\n-- @funksoup, @aaronfranke & @JoyceBettencourt will attend the evening (9pm EDT) MSF Oversight meeting tonight (April 19) to highlight this issue and inform people of the impact of the proposed standards.\r\n\r\nMedia group: \r\n- Media group will be starting a newsletter \r\n\r\n\r\nWORLD HOPS:\r\nProposal to do a metatraversal world hop that is a real world/virtual world hybrid event for [AWE](https://www.awexr.com/)? \r\nAWE conference is May 31-June 2 in Santa Clara, CA. If we can get some folks who will be onsite at AWE to help facilitate, we could do an OMI metatraversal world hop, similar to what we did at the OMI 100th meeting anniversary event. \r\n\r\nWe could visit / meet in these spaces (via @madjin): \r\nhttps://hyperfy.io/msf\r\nhttps://hyperfy.io/neonstreet\r\nhttps://hyperfy.io/omi\r\nhttps://framevr.io/omi\r\n\r\n![Metaverse Standards Forum Plenary #7 APC 12Apr23](https://user-images.githubusercontent.com/34685781/233160931-131b8af1-5cb2-4141-a6ed-ec13236ba0e5.jpg)\r\n\r\nKeyframe mentioned he will be at AWE onsite,  and will be giving a talk on \"Mapping the Web3 Immersive Platforms\" on May 31 at 5:35-6pm. He may be able to facilitate the world hop and possibly facilitate streaming his talk (into our immersive space and vice versa) as well. Evo will be onsite at AWE as well (and may be able to facilitate a world hop).\r\n\r\nMal mentioned the possibility of using Discord for the world hop, i.e., have the rooms Hyperfy and FrameVR, etc and then have Discord open with folks streaming from different rooms, so that Discord output can be streamed back into the 'meat space' venue at AWE.\r\n\r\nOUTREACH:\r\nKeyframe also mentioned that he will be at the following events and could promote OMI as part of his presentations:\r\n[Boom Festival in Portugal](https://boomfestival.org/boom2023/program/)\r\n[Miami Art Week / Bit Basel](https://bitbasel.com/miami-art-week)\r\n\r\nAction steps: \r\nKeyframe requested OMI slides. We have them somewhere, but where? Let's follow up with Media group (@pcsmgnt, Evo).\r\nDo we have updated images / videos for OMI slides? Ideally, would be great to have a post-mortem for our 100th meeting anniversary. \r\nFor now, @JoyceBettencourt re-posted these images:\r\n\r\n![OMI_100_group_1](https://user-images.githubusercontent.com/34685781/233160785-5c8302ea-c172-4de7-b8ee-20a3c49e7e73.png)\r\n![OMI_100_group_2](https://user-images.githubusercontent.com/34685781/233160802-0141fa93-defb-4291-a69e-94ede086c5fb.png)\r\n\r\nAnd Mal Burns re-posted the youtube link for the [OMI panel he moderated for the last Open Source Community Conference](https://www.youtube.com/watch?v=X9WqJMf9cK8).\r\n\r\nTo follow up on organizing the proposed world hop for AWE, we can use our [pro temp events channel in Discord](https://discordapp.com/channels/770382203782692945/1052644259741843526).","author":{"login":"funksoup"},"comments":{"nodes":[]},"labels":{"nodes":[]}},{"id":"D_kwDOFUbqUM4ATYOD","category":{"name":"General"},"upvoteCount":1,"updatedAt":"2023-04-12T22:43:13Z","createdAt":"2023-04-12T22:01:36Z","number":379,"title":"Backlog refinement discussion","body":"We are thinking we can use discussions more for things that don't have a official \"owner\" or assignee. Some of the tickets in [our backlog]() are from the early days of OMI and are still worth discussion, but are not exactly work items. \r\n\r\nWe are also discussing potential standard operating procedures moving forward (SOPs). \r\n- if a ticket is going to become an issue, it will need an assignee and an estimation of completion or the next iteration. \r\n  - having a ticket assignee is a point of accountability. But we understand that life happens. \r\n    - if you can no longer complete something you said you would by being assigned the ticket, just say so in the comments. \r\n      - this can be scary \r\n      - we want to promote psychological safety to ensure that we have an honest understanding of where we are at with respect to our commitments or estimated timelines. \r\n    - If you need help, you should be able to ask for help in the issue. \r\n  - having an estimated check-in date is not about timelines\r\n    - its about ensuring we are being realistic about what we can and can not achieve asynchronously between our next meetings. \r\n    - these don't have to be rigid completion dates, but rather \"I think I can get x done by the next time we meet\". \r\n- Anyone who participates should feel empowered to propose work items, start discussions, and report blockers. \r\n  - not everyone can view the projects board (sometimes called the kanban board, or the \"backlog\") \r\n  - everyone can submit an issue using an issue template \r\n- a Product Owner (PO, Scrum Master (SM) or some assigned accountability lead should periodically \"maintain the backlog\"\r\n  - before Wednesday calls (and eventually this can be replicated in working groups too) review submitted issues. \r\n  - suggested issues probably **wont* have a assignee.\r\n  - new issues hopefully have a suggested alternative or estimated bite-size piece of the proposal. \r\n- We want it to be easier for new people to get involved. \r\n- what about items that _must be done_? \r\n  - some can pre-consent to being assigned tickets to them \r\n    - ex. Hey I remembered we need to submit our receipts this week or our card will get cancelled. I am assigning a due date of Friday, and tagging @mrmetaverse \r\n    - or \"the ministry of submitting receipts\" haha \r\n    - the \"IT security team\" \r\n    - the \"Website team\" \r\n    - how do I get something on the calendar? cal team \r\n    - how do I into youtube? media team \r\n    - who can I ask for help publishing this blog? \r\n    - who can help create events? \r\n- reporting blockers helps us know that we need to help! \r\n  - blockers should be prioritized \r\n  - energy lost on blockers that don't budge drain contributors focus and availability. \r\n","author":{"login":"mrmetaverse"},"comments":{"nodes":[]},"labels":{"nodes":[{"id":"MDU6TGFiZWwzMzM2MTIxMTkw","name":"Make the metaverse more human","color":"EF476F","description":"We collaborate, driven by research, privacy and accessibility, to make the metaverse more human."},{"id":"MDU6TGFiZWwzMzM2MTI0ODk2","name":"Maintain sustainable innovation","color":"00B183","description":"By creating a cooperative, sustainable,  culture of innovations"}]}},{"id":"D_kwDOFUbqUM4ATYPJ","category":{"name":"Ideas"},"upvoteCount":1,"updatedAt":"2023-04-12T22:44:52Z","createdAt":"2022-09-05T20:54:12Z","number":384,"title":"Proposed migrations: Jitsi* and ProtonMail/Cal and Element/Matrix","body":"These products prioritize security and/or Open Source. \r\n\r\nProton offers 10 emails, and up to three custom domains, so we can have 8-9 OMI group emails if we want all for a total of $11.99/mo. \r\n\r\nI'd like to see us migrate to more open source and privacy-focused tools. Ultimately, I think we could shift away from discord and github too. \r\n\r\nI can demo both during a future Wednesday call. \r\n\r\n","author":{"login":"mrmetaverse"},"comments":{"nodes":[{"id":"DC_kwDOFUbqUM4AVWq-","author":{"login":"mrmetaverse"},"body":"Cc: @antpb can we add this to the upcoming agenda?  \r\n\r\nCc: @humbletim maybe this could work for our previous email needs "},{"id":"DC_kwDOFUbqUM4AVWq_","author":{"login":"fire"},"body":"It is unclear that these proprietary services are better than self hosting, or gmail, and for example self hosting email is a nightmare.\r\n\r\nWe can selfhost video and voice chat or use https://meet.jit.si\r\n\r\nOur status quo is that meetings are recorded, so it doesn't request privacy concerns."},{"id":"DC_kwDOFUbqUM4AVWrA","author":{"login":"fire"},"body":"The main purpose of Github is its reach as a social network. I've had great experience with https://gitlabhost.com/ (using their community edition instead of enterprise) but it is not recommend because such a site does not have the reach or impact."},{"id":"DC_kwDOFUbqUM4AVWrB","author":{"login":"madjin"},"body":"Highly in favor of proposals like this that inch us closer to becoming more digitally sovereign. Protonmail and Jitsi are good, but I wonder if there's a Matrix solution out there worth considering? @robertlong "},{"id":"DC_kwDOFUbqUM4AVWrC","author":{"login":"mrmetaverse"},"body":"> Highly in favor of proposals like this that inch us closer to becoming more digitally sovereign. Protonmail and Jitsi are good, but I wonder if there's a Matrix solution out there worth considering? @robertlong\r\n\r\nAgreed, I'd like to switch everything over to matrix/element and understand what some may see as a \"conflict of interest\" considering our co-chairs affiliation, but through my research it seems to be the best option. Robert has suggested waiting for a few key features before the migration will be more demonstrably worth the effort. \r\n\r\nWe actually reserved both OMI and openmetaverse in matrix, and can migrate any time. But tools like jitsi and protonmail solve for different issues, like how we cast our meetings, and how we field receipts/news/updates and calendar. \r\n\r\nI guess a loose migration plan looks: \r\n\r\nActivity | Current | Migrate to _something like this_\r\n---|---|---\r\nEmail and Calendar | gsuite | -> Proton (Mail, Cal, Drive)\r\nChat and Channels | discord | -> element / matrix\r\nDocumentation and Issues | Github | -> Gitlab\r\nStreaming and Video Calls | Meet and Discord | -> Jitsi (continue to be bridged to youtube and streamyard)\r\nWorkshops and Brainstorming | miro | -> tldraw\r\n\r\n\r\n\r\n"},{"id":"DC_kwDOFUbqUM4AVWrD","author":{"login":"mrmetaverse"},"body":"Rocketchat is a free open source privately hosted text chat. This is what godot uses. Could possibly be integrated with discord. "},{"id":"DC_kwDOFUbqUM4AVWrE","author":{"login":"mrmetaverse"},"body":"Big Blue Button - alternative for meetings and conferences"},{"id":"DC_kwDOFUbqUM4AVWrF","author":{"login":"mrmetaverse"},"body":"I would suggest moving to gitlab, but its a per-user charge for feature parody, and that is not a wise move for our open model. Unless I am missing something here. \r\n\r\nI propose migrating to a gitea service, either self-hosting or using something like codeberg. "},{"id":"DC_kwDOFUbqUM4AVWrG","author":{"login":"mrmetaverse"},"body":"So... what can we do now? Do we want to migrate from google to proton? Or start using element instead of discord? Or start streaming using youtube live and jitsi and matrix, etc.? \r\n\r\n## How might we make this actionable today? "},{"id":"DC_kwDOFUbqUM4AVWrH","author":{"login":"mrmetaverse"},"body":"![image-4.png](https://user-images.githubusercontent.com/63426722/205417428-c4b8f905-a793-480f-980d-abed648a5c62.png)"},{"id":"DC_kwDOFUbqUM4AVWrI","author":{"login":"madjin"},"body":"## Proton > Gsuite\r\n\r\nThis deal goes on through end of the year, it will cost about $172 for 24 months for 3 custom email domains (@omigroup.org for example) and up to 15 email addresses (like an alias). This will save admin time from having to think about this stuff every month, saving us untold amounts of stress / administrative overhead costs.\r\n\r\nProton supports lots of good payment options too, and it will give us awesome gsuite like features such as 500gb of space. It's more private than Google and easy to import.\r\n\r\n![image](https://user-images.githubusercontent.com/32600939/205417854-cacd3969-9281-46a1-8b9c-91376f8b09c7.png)\r\n\r\n## tldraw > Miro\r\n\r\nCurrently Miro is costing us $40 a month and doesn't seem like it's worth the money, there's an open source project called [tldraw](https://github.com/tldraw/tldraw) that has many of the same features and MIT licensed.\r\n\r\n"},{"id":"DC_kwDOFUbqUM4AVWrJ","author":{"login":"fire"},"body":"The privacy of self hosting and fear of corporations is not the problem we're solving.\r\n\r\nFrom our months of omigroup champion meetings the time that is spent was done on administrative collection of receipts for open collective. That has been many workhours of multiple people's times.\r\n\r\nMy proposal is to pick a choice Miro? 1password? Gsuite? protonmail? Blog? etc. Any paid service for a long period of time like a year.\r\n\r\nJin and humbletim have discussed with me."},{"id":"DC_kwDOFUbqUM4AVWrK","author":{"login":"mrmetaverse"},"body":"I move to sign up for proton for 2 yrs \n\nI move to reduce miro to 1 seat or less and adopt the proposed alternative `tldraw` \n\nThe cc payments are a recurring friction/frustration so I support your proposal to reduce the monthlies. \n\nShould we vote or make the cancels/purchase?"},{"id":"DC_kwDOFUbqUM4AVWrL","author":{"login":"madjin"},"body":"I say we budget $300 for 2 years of email + proton services- $200 for proton and $100 for the person helping setup and administrate: https://protonvpn.com/blackfriday/#cards"},{"id":"DC_kwDOFUbqUM4AVWrM","author":{"login":"fire"},"body":"1. as far as I know the main service we're providing through gmail is the MSF emails.\r\n2. gsuite is an industry standard like office 365. proton mail is not standard."},{"id":"DC_kwDOFUbqUM4AVWrN","author":{"login":"fire"},"body":"The essential service we're providing and causes OMIGroup problems if disrupted is the email service.\r\n\r\nMiro and Figjam have been great events but aren't essential to the services we've providing.\r\n\r\nChanging from an gmail address to an protomail address is adminstrative work. What are we gaining?\r\n\r\nWhat is the cost to provide gmail for every partipating member of omigroup in chunks of a year?"},{"id":"DC_kwDOFUbqUM4AVWrO","author":{"login":"mrmetaverse"},"body":"Ill add that open source includes an ethos. Often when I get feedback from those in the private sector they say \"you have to prove to founders and funders alike that open source and collaborative standards outweigh the value propositions of electing to build a walled garden.\" I believe this is true. \n\nI think adopting private (non-data harvesting) and/or open source alternatives helps _show_ instead of tell. Maybe I'm being grandiose but I'm happy to see practical viability, and feasibility use cases driving the decision as well. \n\nJust beware, we do generally sacrifice some fidelity of usability. I am generally ok with this for myself, and have tested both of the suggested changes in our previous comments so I am confident they will do more than suffice. "},{"id":"DC_kwDOFUbqUM4AVWrP","author":{"login":"madjin"},"body":"Isn't g-suite costing lots of administrative overhead without bulk payment options?"},{"id":"DC_kwDOFUbqUM4AVWrQ","author":{"login":"fire"},"body":"https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F1247364%3Fhl%3Den&product_context=1247364&product_name=UnuFlow&trigger_context=a"},{"id":"DC_kwDOFUbqUM4AVWrR","author":{"login":"mrmetaverse"},"body":"> https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F1247364%3Fhl%3Den&product_context=1247364&product_name=UnuFlow&trigger_context=a\n\n![Screenshot_20221202-223325.png](https://user-images.githubusercontent.com/63426722/205420752-9e3ad073-404e-4acf-8af8-c5e718a3aca9.png)\n\n🫠"},{"id":"DC_kwDOFUbqUM4AVWrS","author":{"login":"mrmetaverse"},"body":"> The essential service we're providing and causes OMIGroup problems if disrupted is the email service.\n> \n> Miro and Figjam have been great events but aren't essential to the services we've providing.\n> \n> Changing from an gmail address to an protomail address is adminstrative work. What are we gaining?\n> \n> What is the cost to provide gmail for every partipating member of omigroup in chunks of a year?\n\nI appreciate the thoughtful questions. \n\nScalability without needing to add more seats for a little while. Scalability for domains and potential tangential efforts, maybe we never need it, but its included. \n\nAnd the storytelling aspect is worth something imo. Showing that alternatives exist outside of the many duopolies. \n\nAnd cost "},{"id":"DC_kwDOFUbqUM4AVWrT","author":{"login":"fire"},"body":"![image](https://user-images.githubusercontent.com/32321/205424953-a06ee7c4-4545-4794-9adb-e36969b41fb4.png)\r\n"},{"id":"DC_kwDOFUbqUM4AVWrU","author":{"login":"mrmetaverse"},"body":"Most practical: \r\n- I recommend we cancel our Miro and switch to tldraw. \r\n- any paid services we should strive to pay for longer periods (2 years if possible) \r\n- switching from gsuite to proton would require training people. There are some conflicts like \"there aren't any google docs or sheets equivalents\" "},{"id":"DC_kwDOFUbqUM4AVWrV","author":{"login":"mrmetaverse"},"body":"converting to a discussion. "}]},"labels":{"nodes":[{"id":"LA_kwDOFUbqUM7Kw_W4","name":"meta","color":"c5def5","description":"Issues about the OMI repo"}]}},{"id":"MDEwOkRpc2N1c3Npb241MDc5OTcy","category":{"name":"R&D"},"upvoteCount":1,"updatedAt":"2023-04-12T22:22:13Z","createdAt":"2021-05-19T00:38:15Z","number":380,"title":"OMI Identity","body":"# OMI Identity\r\n\r\n## Contributors\r\n\r\n- Robert Long, Independent Contributor\r\n\r\n## Summary\r\n\r\nI'd like to kick off discussion around an interoperable identity specification. By identity I'm referring to an identifier that resolves to a document full of profile data. I'd like to scope the data contained in this document to two fields for now: display name, and avatar model. The spec will also cover verifying a user's identity.\r\n\r\nThe spec should have three core properties. It should be:\r\n1. Addressable: Given a public identifier you should be able to resolve the document\r\n2. Verifiable: You should be able to determine if the user you are interacting with, is the user associated with the id they are giving you\r\n3. Well formed: This document needs to be specified in a standard format so that an application can resolve your profile data\r\n\r\n## Example Use Cases\r\n\r\nIn my work on Mozilla Hubs we purposely made our identities lightweight, both for privacy reasons and for the ability to integrate Hubs into other systems. As soon as people started hosting their own Hubs Cloud instances we noticed the friction associated with even this lightweight identity system. You need to set your name and avatar every time you move to a new server. This generally requires uploading your avatar model or going through and finding an avatar again. People are generally very attached to their avatars, it represents their digital self. When people find something that they identity with, they want to use it everywhere.\r\n\r\nPeople also want to be able to verify that a person are who they claim to be. In Hubs, unless your room is connected to a Discord room, you can set whatever name you wish. Including duplicates of a given name. You can spoof someone's identity very easily. In Hubs, most of the meetings we have are private and we can trust the users in the room. However, as we create more public spaces, being able to verify a user's identity becomes more important.\r\n\r\n## Implementation\r\n\r\n### Decentralized Identifiers (DID)\r\n\r\n[Decentralized Identifiers](https://www.w3.org/TR/did-core/) look like a perfect spec to use for address resolution and identity verification. It is really only missing the profile data model.\r\n\r\nDID identifiers look like this:\r\n\r\n```\r\ndid:example:123456\r\n```\r\n\r\nWhere `did` is the scheme, `example` is the method, and `123456` is the id.\r\n\r\nDID identifiers resolve to documents which contain data for verification of the subject via public key encryption, authentication as the subject of the identifier, or a number of other verification relationships expressed in the spec.\r\n\r\nHowever, the documents are [not intended for storing store personal data](https://www.w3.org/TR/did-core/#keep-personal-data-private). Documents can contain an array of services which can then have access control for this personal data. However, linking to services with public personal data still seems to be discouraged.\r\n\r\nI'm still a bit confused on how best personal data should be resolved from a DID and could use some help here. In the section of the spec on [service privacy](https://www.w3.org/TR/did-core/#service-privacy) the authors recommend a single service url without any additional user identifiers. In our context, perhaps this is a home server domain and the DID identifier can then be used to get the public user profile data. @dmitrizagidulin I could use some of your help here.\r\n\r\nYou may also want to lock down your profile data so that only your close connections can see your avatar/display name. I'm not so sure how to express this within the DID ecosystem.\r\n\r\n### ActivityPub\r\n\r\nAnother solution could be to use [ActivityPub](http://activitypub.rocks/). This is the protocol behind Mastodon and PixelFed. My public ID is: `@robertlong@mastodon.online` and from there you can find my public profile. The ActivityPub spec is already built to be extensible and add things like avatar info. @wmurphyrd already has an implementation of such a thing with [immers.space](https://immers.space/).\r\n\r\nSensitive user profile information could be hidden except for mutual followers, which is a big plus. There's also a social graph which is appealing for the friends list spec I'd love to propose next.\r\n\r\nI do have a few outstanding questions about ActivityPub though:\r\n\r\n1. In a public space, how can one user verify the identity of another? If I'm connected with another user over P2P and another user broadcasts their id as `@example@mastodon.online` how can I check that they are in-fact that user? @cwebber and @dmitrizagidulin I could use your help here. I see there's already Keybase support on Mastodon. What other methods of verification are already out there or could be used?\r\n2. How much work is it going to be for apps to implement fetching user data from ActivityPub? @wmurphyrd, you've got very tight integration with ActivityPub in Immers.space, but what about for those apps which want a more lightweight integration? What options are out there?\r\n\r\n### Data Model\r\n\r\nWith any solution the profile data I think we should focus on in its simplest form is this:\r\n\r\n```json\r\n{\r\n  \"displayName\": \"Robert Long\",\r\n  \"avatar\": {\r\n    \"mimeType\": \"model/gltf-binary+vrm\",\r\n    \"url\": \"https://robertlong.me/files/avatar.vrm\"\r\n  }\r\n}\r\n```\r\n\r\nApplication specific avatars or an avatar collection are things we should discuss as well. We also should discuss supporting multiple identities.\r\n\r\nI'd like to keep discussing this topic in this issue. If you have specific proposals for identity, go ahead and create another issue where we can discuss the implementation further. I'm hoping we can get a couple subject matter experts to weigh in and guide us towards the correct solution. If you are a possible implementer of an application that might want to use this identity specification, please let us know what your specific requirements are below.\r\n\r\nLooking forward to talking more!","author":{"login":"robertlong"},"comments":{"nodes":[{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2Mg==","author":{"login":"wmurphyrd"},"body":"Some notes on how these items are commonly implemented in the fediverse. \r\n\r\n**Addressable**: We use webfinger ([Mastodon explainer](https://docs.joinmastodon.org/spec/webfinger/)). This is the same web standard e-mail uses. Webfinger means you can translate an identifier to a URL by using a standarized API path. E.g. given `username@domain` you know that `https://domain/.well-known/webfinger?resource=acct:username@domain` will return a JSON document that tells you exactly where to fetch the user's full profile. I like this approach because it **does not** require standardization of every application's API routes for fetching or interacting with users, just the one \"well known\" route for dereferencing a human readable user identifier\r\n\r\n**Verifiable**: Public key encryption, must commonly used with the http-signatures standard. ([Mastodon explainer](https://docs.joinmastodon.org/spec/security/#http)). The user profile (Actor object) retrieved from the URL you get via webfinger includes a public key, and all ActivityPub messages sent by that user are signed with their private key. With just pure ActivityPub + signatures you could verify that a specific user is truly in the room with you (a signed Arrive activity), but we'd probably want to add another signed message here on the realtime layer to also verify that a specific entity in the room is the right person\r\n\r\n**Well formed**: That's ActivityPub itself - [the Actor object](https://www.w3.org/TR/activitypub/#actor-objects). The standard gives you everything you need to exchange messages and is easily extensible\r\n\r\n\r\n>How much work is it going to be for apps to implement fetching user data from ActivityPub? @wmurphyrd, you've got very tight integration with ActivityPub in Immers.space, but what about for those apps which want a more lightweight integration? What options are out there?\r\n\r\nThat's the purpose of the [Immers server](https://github.com/immers-space/immers) - it is a microservice that runs alongside your XR experience. It handles all ActivityPub compliance and federation, account registration, and [OAuth2 authorization server](https://github.com/immers-space/immers/wiki/Reciprocal-OAuth2-authorization-explainer) so that users can login to your experience with accounts created on other experiences (with recently released [access grant control for users](https://github.com/immers-space/immers/releases/tag/v1.1.0)), but it does not dictate anything about your XR experience. You choose what and how to integrate into your experience without having to worry about specs, authorization, and server-to-server communications.\r\n\r\n"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2Mw==","author":{"login":"wmurphyrd"},"body":"@robertlong here's a theoretical example of using ActivityPub and DID together: https://github.com/WebOfTrustInfo/rwot5-boston/blob/master/draft-documents/activitypub-decentralized-distributed/activitypub-decentralized-distributed.md#distributed-identity"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2NA==","author":{"login":"lyuma"},"body":"We need to make sure that whatever implementation of OMI identity we base our specification on be compatible with both proprietary use cases and open source licenses, be it \"Immers\" or one of the Mastodon based implementations.\r\n\r\nAbout other implementations...\r\n- From chatting with @fire, the possibility of using Matrix was brought up. There is a possible simplified implementation of Matrix identity in Jel by @gfodor , though from what I can see, it uses a **axa**, a fork of the Synapse matrix.org server. As this is also based on Synpase it would fail the \"two-implementations rule\". Perhaps Greg has some insight on a second implementation.\r\n\r\n- OpenID Connect were brought up. I think the issue with them is they do not provide public/private keys for users. Also, it seems crippled: fire notes that in practice OpenIDC's design forces implementers to pick a small, finite set of identity providers (for example, Google, Facebook, Apple, Twitter, GitHub) and therefore, decentralized identity providers would not be compatible with almost all implementations in practice. For example, Fire notes that you can't go to Steam and login with your Mozilla identity provider because it's too niche.\r\n\r\nThere's also a question of complexity: the simpler the implementation, the easier it will be to port to other server-side languages.\r\n\r\nIn particular, if I have an existing account database or identity provider written in some language, I would need to be able easily integrate some implementation of the OMI Identity service into my existing backend.\r\n\r\n"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2NQ==","author":{"login":"wmurphyrd"},"body":"@lyuma could you expand on your concerns here:\r\n\r\n>We need to make sure that whatever implementation of OMI identity we base our specification on be compatible with both proprietary use cases and open source licenses, be it \"Immers\" or one of the Mastodon based implementations."},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2Ng==","author":{"login":"lyuma"},"body":"Specifically, GPL and AGPL code cannot be embedded inside of a proprietary application without having implications regarding the release of linked source code.\r\n\r\nFor the purpose of OMI, we need to be inclusive of proprietary applications, so any code used as part of a standard would ideally be MIT or BSD type licenses."},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2Nw==","author":{"login":"wmurphyrd"},"body":"@lyuma In my opinion, OMI should not be endorsing any specific implementation, just choosing a standard. Then licensing isn't an issue, especially if it's from an open standards organization like W3C.\r\n\r\nFor ActivityPub in particular, there are open source implementations in several languages already. Here's some off the top of my head\r\n\r\nGeneral purpose libraries:\r\n\r\n* [activitypub-express](https://github.com/immers-space/activitypub-express) - NodeJS, MIT (created by me)\r\n* [GoFed/activity](https://github.com/go-fed/activity) - Go, BSD\r\n\r\nApplications that include ActivityPub implementation:\r\n\r\n* [Mastodon](https://github.com/tootsuite/mastodon) - Ruby, AGPL\r\n* [Pleroma](https://git.pleroma.social/pleroma/pleroma) - Elixir, AGPL\r\n\r\n"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2OA==","author":{"login":"robertlong"},"body":"Thanks for the responses!\r\n\r\n>E.g. given username@domain you know that https://domain/.well-known/webfinger?resource=acct:username@domain will return a JSON document that tells you exactly where to fetch the user's full profile. I like this approach because it does not require standardization of every application's API routes for fetching or interacting with users, just the one \"well known\" route for dereferencing a human readable user identifier\r\n\r\nYeah this is great! I've looked at WebFinger before, but admittedly haven't given it enough thought recently. It's a pretty simple yet powerful solution for addressability. It's not quite as flexible as DID, seeing as it requires a domain and the identifiers follow a more specific format. I think that's better in some ways because it's more human-readable. However, for those of us looking to look up someone's profile from something like a Ethereum address, I imagine you could use Ethereum Name Service, or Namecoin, or Handshake, then do a reverse lookup to get the record for WebFinger.\r\n\r\nThen adding DID fields to the Actor object or a public key would allow you to do proper verification. Agreed that some sort of realtime protocol would be necessary to properly verify you are communicating with a specific user. I don't think we need to define that at this point, but we really should ensure that public keys are in the profile data so that apps can use it.\r\n\r\n> For the purpose of OMI, we need to be inclusive of proprietary applications, so any code used as part of a standard would ideally be MIT or BSD type licenses.\r\n\r\nAgreed on this. We need non-copyleft options for applications to use. However, I also agree with @wmurphyrd that we shouldn't endorse a specific implementation. The challenge then is just making sure that creating your own implementation is simple enough.\r\n\r\nI had a look at activitypub-express. It looks really good! I like the modular approach and the integration into express looks super simple. Still, the implementation itself is somewhat large. Requiring other developers to implement all of the ActivityPub spec if they just want to create a homeserver for OMI seems unnecessary. Perhaps we can agree on a required subset of the ActivityPub spec to handle identity?\r\n\r\nOn the W3C SocialCG call this morning, @wmurphyrd, @dmitrizagidulin, and I talked a bit about possibly creating an extremely limited subset of the ActivityPub spec to manage identity. I asked if an ActivityPub implementation that only included the `Actor` object and an inbox/outbox would be in the spirit of the fediverse community. I'll post shortly in the SocialCG forum about this and get their feedback on it. However, I think it should be accepted as valid. ActivityPub has been accepting of other projects that only support a subset of the spec. This is an extreme example though.\r\n\r\nIf we were to go down this route, developers looking to implement an OMI homeserver would only need to support activities for modifying an actor and implement the correct data model for getting the required `Actor` fields. I think that would be really simple to implement. It also gives us a base to go ahead and start implementing other things like a friends list or inventory collection. They'd be modular and could be expressed via various JSON-LD vocabularies."},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc2OQ==","author":{"login":"robertlong"},"body":"> From chatting with @fire, the possibility of using Matrix was brought up. There is a possible simplified implementation of Matrix identity in Jel by @gfodor , though from what I can see, it uses a axa, a fork of the Synapse matrix.org server. As this is also based on Synpase it would fail the \"two-implementations rule\". Perhaps Greg has some insight on a second implementation.\r\n\r\nI'd also like to invite more discussion around Matrix. It also has addressable identity and verification. It is extensible so you could add the necessary profile information. But like ActivityPub, it comes with a ton of baggage. It's a chat protocol, so if your application/homeserver doesn't need chat, then why bring that with the minimal spec? It kinda goes against the modular approach.\r\n\r\nOn the other hand, it could provide a standard method for realtime communication. I feel like Matrix makes sense to integrate into the OMI ecosystem in another way. Realtime notifications for trades, friend requests, etc. could be sent via Matrix. It could also be used to set up P2P networking for certain applications. So I don't want to push Matrix out of our larger discussion around OMI specs. I just think if we're talking identity, requiring all of Matrix seems heavy handed."},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc3MA==","author":{"login":"robertlong"},"body":"I've posted to the SocialHub here: https://socialhub.activitypub.rocks/t/minimum-viable-activitypub-implementation/1790 feel free to chime in there."},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc3MQ==","author":{"login":"wmurphyrd"},"body":"> Agreed on this. We need non-copyleft options for applications to use. However, I also agree with @wmurphyrd that we shouldn't endorse a specific implementation. The challenge then is just making sure that creating your own implementation is simple enough.\r\n\r\nFor the record, we consider use of the Immers server to be compatible with proprietary software. Because it packaged as a microservice, the AGPL requirements do not extend beyond the container boundary. [Here's an entry in our FAQ on the subject](https://web.immers.space/immersive-web-creators-frequently-asked-questions/#agpl-boundary). I believe this is a well-established interpretation with documented support from FSF (if there's doubt/interest on this subject, I could write an article). For the client side, we'll be putting out an MIT licensed library very soon. \r\n\r\n> \r\n> I had a look at activitypub-express. It looks really good! I like the modular approach and the integration into express looks super simple. Still, the implementation itself is somewhat large. Requiring other developers to implement all of the ActivityPub spec if they just want to create a homeserver for OMI seems unnecessary. Perhaps we can agree on a required subset of the ActivityPub spec to handle identity?\r\n\r\n@robertlong I'd like to have a longer discussion on this topic sometime. When I look at ActivityPub (and the implementation in ApEx), I see a lightweight spec that covers the bare bones of establishing and federating identity, so I'd like to learn more about  your concerns here. \r\n"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc3Mg==","author":{"login":"sebilasse"},"body":"> @robertlong here's a theoretical example of using ActivityPub and DID together: https://github.com/WebOfTrustInfo/rwot5-boston/blob/master/draft-documents/activitypub-decentralized-distributed/activitypub-decentralized-distributed.md#distributed-identity\r\n\r\nyep, and there is this nice DID method: \r\nhttps://trustbloc.github.io/did-method-orb/"},{"id":"MDE3OkRpc2N1c3Npb25Db21tZW50NTU5Nzc3Mw==","author":{"login":"robertlong"},"body":"> @robertlong I'd like to have a longer discussion on this topic sometime. When I look at ActivityPub (and the implementation in ApEx), I see a lightweight spec that covers the bare bones of establishing and federating identity, so I'd like to learn more about your concerns here.\r\n\r\nI took some more time over the weekend to dig into WebFinger and ActivityPub further. I think you're right. It can be a very simple spec around WebFinger and the ActivityStreams Actor model. I'd like to talk more about the server to server protocol as well. Are there any parts that we would need to implement for the most barebones implementation?"},{"id":"DC_kwDOFUbqUM4AVWpO","author":{"login":"robertlong"},"body":"Moving to backlog due to inactivity. We'll pick this back up at a later date. Discussion ongoing in the #omi-identity channel."},{"id":"DC_kwDOFUbqUM4AVWpP","author":{"login":"mrmetaverse"},"body":"Hey! We are reviewing old tickets today during backlog refinement. Any interest in resuming this discussion or should I convert this to a discussion? \r\n\r\nWe are now realizing that things like this could open as discussions in the discussions section too since we are still using discussions. "},{"id":"DC_kwDOFUbqUM4AVWpQ","author":{"login":"robertlong"},"body":"Sounds good to me. Curious to see what people have in mind on identity nowadays. We're using Matrix ids for identity at Third Room, you can bridge all sorts of other platforms with Matrix and connect third party identities. It's a good solution for us. DID looks interesting as well but I've not seen it get any traction. Mastodon just passed 10m users and is based on ActivityPub. They're doing great! So perhaps that should get more people's attention in this space."}]},"labels":{"nodes":[{"id":"MDU6TGFiZWwzMzM2MTIxMTkw","name":"Make the metaverse more human","color":"EF476F","description":"We collaborate, driven by research, privacy and accessibility, to make the metaverse more human."},{"id":"MDU6TGFiZWwzMzM2MTIzMjYz","name":"Empower the people making the metaverse","color":"623CEA","description":"Incentivize contributions by empowering the people making  the metaverse"},{"id":"LA_kwDOFUbqUM7Kvvhc","name":"Call for Participation","color":"049F39","description":"A new group is looking for members."}]}}]}}}}